{"/Firmware-Flash/Updating_EBB_klipper_firmware_via_CanBoot":{"title":"Updating klipper on the EBB with CanBoot","data":{"requirements#Requirements":"This is for use with a working printer that requires the klipper firmware on the EBB to be updated. You must have Flashed CanBoot and Klipper per the initial flashing instructions.","updating-klipper#Updating Klipper":"You will need the canbus ID for your EBB, it can be found in your printer.cfg file under [mcu EBBcan], write this down, you will need it later in the process.","make-the-klipper-firmware#Make The klipper firmware":"Stop the klipper Service (This can be done from in mainsail)Connect to your printer via SSH\n$ cd ~/klipper\n$ make menuconfig\n(Top) \n                             Klipper Firmware Configuration\n[*] Enable extra low-level configuration options\n    Micro-controller Architecture (STMicroelectronics STM32)  --->\n    Processor model (STM32G0B1)  --->\n    Bootloader offset (8KiB bootloader)  --->\n    Clock Reference (8 MHz crystal)  --->\n    Communication interface (CAN bus (on PB0/PB1))  --->\n(1000000) CAN bus speed\n()  GPIO pins to set at micro-controller startup\nPress Q to save and then run make from the terminal:\n$ make","flash-via-canboot#Flash via Canboot":"Canboot was recently renamed to Katapult. Depending on your installation you may need to substitute katapult for CanBoot below.\nVia SSH:\ncd ~/CanBoot/scripts\npython3 flashtool.py -i can0 -f ~/klipper/out/klipper.bin -u <uuid>    # replacing <uuid> with the uuid for your EBB\nWait for the flash to finish.\nReboot your printer.\nIn the event the Klipper flash fails and the EBB becomes unresponive, it can be recovered by reflashing over USB according to the initial flashing instructions, startimg with flashing canboot. The 5v jumper on the EBB is not needed if the board is powered from the printer."}},"/Firmware-Flash/flash-m8p-v1-ebb":{"title":"CBT Kit Manta M8P V1 + CB1 Start Guide","data":{"":"MPX kits stopped shipping with the V1 version of the Manta M8P in late 2023. Proceed with the instructions on this page only if you are absolutely sure that you have the V1 version of the Manta. The process for flashing the currently shipping Manta V2 is described on the Flash M8P V2 and EBB SB2209 page.","preparing#Preparing":"You need to prepare a USB Type-C cable and have 5V output.(Recommened USB-Type B to Type C, some PD charger may ouput over 5V via C2C cable, it may burn your M8P)Strongly recommened to use a USB Wall Charger, some PC USB ports don't have enough power and will cause random issues.","wiring#Wiring":"Strongly recommened flash them before installed, wire like thisJumpers: V_USB on M8P, USB_5V on EBB SB, 120R on EBB SBThis pic is made by @Westy_Pity_Da_Fool, it maybe helpful to understand it, notice you need to plug USB cable to EBB SB2209.Wries:USB Cable from EBB SB to M8PCanbus Cable from EBB SB to M8P (canbus 2P connector only)M8P USB Power CableDo not connect the red and black wires, leave them dangling and make sure they do not touch or short circuit each other","flash-cb1#Flash CB1":"Download the latest image name start with CB1_Debian11_Klipper from github, https://github.com/bigtreetech/CB1/releasesThen use balenaEtcher  flash it into your TF card, you don't need to unzip the image.While flash done,  replug the TF card, there have a BOOT partition shown on your PC.Edit system.cfg and change WIFI setting to yours.That's all, now just install the TF card to M8P and install CB1 to M8P.Note: the TF card must install to SOC-CARD, not MCU-CARDNow power on and wait a few minutes, you should be able to see the CB1 IP address in your router.Use your browser to visit the IP address shown on your router. The Mainsail web interface should be displayed.","optionalupdate#[Optional]Update":"Recommened :Update klipper to latest before start","set-cb1-can-bridge-bitrate#Set CB1 Can Bridge Bitrate":"sudo nano /etc/network/interfaces.d/can0\nChange bitrate to 1000000\nallow-hotplug can0\niface can0 can static\n    bitrate 1000000\n    up ifconfig $IFACE txqueuelen 1024\nReboot CB1 by reboot","flash-m8p#Flash M8P":"cd ~/klipper\nmake menuconfig\nThen set it as this pic\n[*] Enable extra low-level configuration options\n    Micro-controller Architecture (STMicroelectronics STM32)  --->\n    Processor model (STM32G0B1)  --->\n    Bootloader offset (8KiB bootloader)  --->\n    Clock Reference (8 MHz crystal)  --->\n    Communication interface (USB to CAN bus bridge (USB on PA11/PA12))  --->\n    CAN bus interface (CAN bus (on PD12/PD13))  --->\n    USB ids  --->\n(1000000) CAN bus speed\n()  GPIO pins to set at micro-controller startup\nPress Q and save it\nmake\nIt would create klipper firmware file out/klipper.binFlash it with DFUPress on BOOT0 and click RESET button\nlsusb\nThere would be a DFU Mode device found, remember its ID, but normally it's 0483:df11\nmake flash FLASH_DEVICE=0483:df11\nbiqu@BTT-CB1:~/klipper$ make flash FLASH_DEVICE=0483:df11\n  Flashing out/klipper.bin to 0483:df11\nsudo dfu-util -d ,0483:df11 -R -a 0 -s 0x8002000:leave -D out/klipper.bin\ndfu-util 0.9\nCopyright 2005-2009 Weston Schmidt, Harald Welte and OpenMoko Inc.\nCopyright 2010-2016 Tormod Volden and Stefan Schmidt\nThis program is Free Software and has ABSOLUTELY NO WARRANTY\nPlease report bugs to http://sourceforge.net/p/dfu-util/tickets/\ndfu-util: Invalid DFU suffix signature\ndfu-util: A valid DFU suffix will be required in a future dfu-util release!!!\nOpening DFU capable USB device...\nID 0483:df11\nRun-time device DFU version 011a\nClaiming USB DFU Interface...\nSetting Alternate Setting #0 ...\nDetermining device status: state = dfuIDLE, status = 0\ndfuIDLE, continuing\nDFU mode device DFU version 011a\nDevice returned transfer size 1024\nDfuSe interface name: \"Internal Flash   \"\nDownloading to address = 0x08002000, size = 28732\nDownload\t[=========================] 100%        28732 bytes\nDownload done.\nFile downloaded successfully\ndfu-util: Error during download get_status\nFailed to flash to 0483:df11: Error running dfu-util\nIf the device is already in bootloader mode it can be flashed with the\nfollowing command:\n  make flash FLASH_DEVICE=0483:df11\n  OR\n  make flash FLASH_DEVICE=1209:beba\nIf attempting to flash via 3.3V serial, then use:\n  make serialflash FLASH_DEVICE=0483:df11\nmake: *** [src/stm32/Makefile:100: flash] Error 255\nif it shows like this, then you have flashed it successfully,now click RST button to restart M8P (it won't restart CB1)Check M8P Can uuid:\npython3 lib/canboot/flash_can.py -q\nbiqu@BTT-CB1:~/klipper$ python3 lib/canboot/flash_can.py -q\nResetting all bootloader node IDs...\nChecking for canboot nodes...\nDetected UUID: 4b94c57be78e, Application: Klipper\nQuery Complete\nremember your M8P can uuid 4b94c57be78e (yours should be different)","flash-ebb-sb2209#Flash EBB SB2209":"Plug the USB-5V jumper and connect it to M8P via USB cable.\ncd ~\ngit clone https://github.com/Arksine/CanBoot\ncd CanBoot\nmake menuconfig\n(Top) \n                        CanBoot Configuration v0.0.1-41-gffd8ac6\n    Micro-controller Architecture (STMicroelectronics STM32)  --->\n    Processor model (STM32G0B1)  --->\n    Build CanBoot deployment application (Do not build)  --->\n    Clock Reference (8 MHz crystal)  --->\n    Communication interface (CAN bus (on PB0/PB1))  --->\n    Application start offset (8KiB offset)  --->\n(1000000) CAN bus speed\n()  GPIO pins to set on bootloader entry\n[*] Support bootloader entry on rapid double click of reset button\n[ ] Enable bootloader entry on button (or gpio) state\n[*] Enable Status LED       \n(PA13)  Status LED GPIO Pin\npress Q and save it then run makeHold on BOOT button and press RST click on EBB SBlsusbThere would be another DFU device 0483:df11Flash it\ndfu-util -a 0 -d 0483:df11 --dfuse-address 0x08000000 -D ~/CanBoot/out/canboot.bin\nbiqu@BTT-CB1:~/CanBoot$ dfu-util -a 0 -d 0483:df11 --dfuse-address 0x08000000 -D ~/CanBoot/out/canboot.bin\ndfu-util 0.9\nCopyright 2005-2009 Weston Schmidt, Harald Welte and OpenMoko Inc.\nCopyright 2010-2016 Tormod Volden and Stefan Schmidt\nThis program is Free Software and has ABSOLUTELY NO WARRANTY\nPlease report bugs to http://sourceforge.net/p/dfu-util/tickets/\ndfu-util: Invalid DFU suffix signature\ndfu-util: A valid DFU suffix will be required in a future dfu-util release!!!\nOpening DFU capable USB device...\nID 0483:df11\nRun-time device DFU version 011a\nClaiming USB DFU Interface...\nSetting Alternate Setting #0 ...\nDetermining device status: state = dfuIDLE, status = 0\ndfuIDLE, continuing\nDFU mode device DFU version 011a\nDevice returned transfer size 1024\nDfuSe interface name: \"Internal Flash   \"\nDownloading to address = 0x08000000, size = 4468\nDownload\t[=========================] 100%         4468 bytes\nDownload done.\nFile downloaded successfully","flash-klipper-by-usb#Flash Klipper by USB":"cd ~/klipper\nmake menuconfig\n(Top) \n                             Klipper Firmware Configuration\n[*] Enable extra low-level configuration options\n    Micro-controller Architecture (STMicroelectronics STM32)  --->\n    Processor model (STM32G0B1)  --->\n    Bootloader offset (8KiB bootloader)  --->\n    Clock Reference (8 MHz crystal)  --->\n    Communication interface (CAN bus (on PB0/PB1))  --->\n(1000000) CAN bus speed\n()  GPIO pins to set at micro-controller startup\npress Q and save it, then run makeSet EBB SB2209 to DFU modeHold and press RST to DFU mode, run lsusb\nFlash it\ndfu-util -a 0 -d 0483:df11 --dfuse-address 0x08002000 -D out/klipper.bin","check#Check":"1.Canboot CheckDouble click RST button, the red LED should blink.\ncd ~/klipper\npython3 lib/canboot/flash_can.py -q\nIf it shows like this, then Canboot has flashed successfully.\nbiqu@BTT-CB1:~/klipper$ python3 lib/canboot/flash_can.py -q\nResetting all bootloader node IDs...\nChecking for canboot nodes...\nDetected UUID: 4b94c57be78e, Application: Klipper\nDetected UUID: 2f0b1ce14660, Application: CanBoot\nQuery Complete\n2.Klipper Checkclick RST Button, LED shouldn't blink anymore\npython3 lib/canboot/flash_can.py -q\nif it shows like this, klipper has flashed successfully\nbiqu@BTT-CB1:~/klipper$ python3 lib/canboot/flash_can.py -q\nResetting all bootloader node IDs...\nChecking for canboot nodes...\nDetected UUID: 4b94c57be78e, Application: Klipper\nDetected UUID: 2f0b1ce14660, Application: Klipper\nQuery Complete\nAll flash works done, now 4b94c57be78e is your M8P uuid, and 2f0b1ce14660 is toolboard uuid.Use these replace printer.cfgRemove v_usb jumper on M8P and usb_5v jumper on EBB SBKeep 120R jumper"}},"/Firmware-Flash/Updating_Manta_klipper_firmware_remotely":{"title":"Updating klipper on the Manta remotely","data":{"requirements#Requirements":"This is for use with a working printer that requires the klipper firmware on the Manta to be updated. You must have at least downloaded the CanBoot repo per the initial flashing instructions as we will use one of its scripts to put the Manta in DFU mode over CAN.","updating-klipper#Updating Klipper":"You will need the canbus ID for your Manta, it can be found in your printer.cfg file under [mcu], write this down, you will need it later in the process.\nNote that on some boards, like the Octopus Pro v1, entering DFU mode can cause undesired actions (such as powering the heater while in DFU mode). I experienced no issue while updating my Manta M8P V2, but this is noted in the klipper docs, so I'm passing it along.","make-the-klipper-firmware#Make The klipper firmware":"Stop the klipper Service (This can be done from in mainsail)Connect to your printer via SSH\n$ cd ~/klipper\n$ make menuconfig\nManta M8P V1\n[*] Enable extra low-level configuration options\n    Micro-controller Architecture (STMicroelectronics STM32)  --->\n    Processor model (STM32G0B1)  --->\n    Bootloader offset (8KiB bootloader)  --->  \n    Clock Reference (8 MHz crystal)  --->\n    Communication interface (USB to CAN bus bridge (USB on PA11/PA12))  --->\n    CAN bus interface (CAN bus (on PD12/PD13))  --->\n    USB ids  --->\n(1000000) CAN bus speed\n()  GPIO pins to set at micro-controller startup\nManta M8P V2\n[*] Enable extra low-level configuration options\n    Micro-controller Architecture (STMicroelectronics STM32)  --->\n    Processor model (STM32H723)  --->\n    Bootloader offset (128KiB bootloader  --->\n    Clock Reference (25 MHz crystal)  --->\n    Communication interface (USB to CAN bus bridge (USB on PA11/PA12))  --->\n    CAN bus interface (CAN bus (on PD0/PD1))  --->\n    USB ids  --->\n(1000000) CAN bus speed\n()  GPIO pins to set at micro-controller startup\nPress Q to save and then run make from the terminal:\n$ make","put-the-manta-in-dfu-mode-via-canboot-script#Put the Manta in DFU mode via Canboot script":"Canboot was recently renamed to Katapult. Depending on your installation you may need to substitute katapult for CanBoot below.\nVia SSH:\n$ python3 ~/CanBoot/scripts/flashtool.py -i can0 -u <uuid> -r    # replacing <uuid> with the uuid for your Manta\nLet's verify that the Manta is in DFU mode:\n$ lsusb\nThere should be a DFU Mode device found. Record its ID, but normally it's 0483:df11.","flash-the-manta#Flash the Manta":"$ make flash FLASH_DEVICE=0483:df11\nRestart your printer\nIn the event the Klipper flash fails and the Manta becomes unresponive, it can be recovered by reflashing the bootloader and then Klipper - see the troubleshooting section of the initial flashing guide. The USB_5v jumper on the Manta is not needed if the board is powered from the printer."}},"/Firmware-Flash/flash-m8p-v2-ebb":{"title":"CBT Kit Manta M8P V2 + CB1 Start Guide","data":{"introduction#Introduction":"MPX kits started shipping the V2 version of the Manta M8P in late 2023. If you have the older V1 version of the Manta, please refer to the Flash M8P V1 and EBB SB2209 page.\nThere are three microprocessors involved in running the printer: the one on the CB1, the one on the Manta M8P, and the one on the EBB SB2209 toolboard. Knowing how they all work together is important. The CB1 runs the show, the Manta gets delegated low level tasks like driving motors and fans from the CB1, and the EBB runs the Stealthburner in cooperation with the Manta.Both the Manta and the EBB run Klipper. However, you will be compiling a different version of Klipper for each board because their processors are different (though the same source code is used for each). There is also something called CanBoot that you will be compiling for the EBB as well. Canboot is what allows future updates of Klipper on the EBB to be done via Canbus instead of USB i.e. over the existing wiring of your completed printer.The process to get this all working is as follows:\nFirst you will get the CB1 processor board up and running by creating a TF card with a Linux image created by BigTreeTech (Flash CB1).\nNext you will get Klipper running on the processor running on the Manta. That is the big chip in the middle of the board. (Flash M8P).\nNext step is putting Canboot on the toolhead board with a connection between them that is initially USB so it can talk Canbus later. You do this because the toolboard isn't be able to talk Canbus out of the box (Flash Canboot to EBB by USB).\nThe last big step is putting Klipper on the toolhead board because both ends need that for this whole thing to work (Flash Klipper to EBB by USB).\nAfter this, there are some final checks that everything is working (Flash Checks). There is a (Troubleshooting) section at the end as well in case of problems.\nIf you have never done anything like this before, relax. Short of letting the magic smoke out, any mistakes in flashing are easily fixed by reflashing the bootloader and starting over. If you are unsure about anything, ask in the MPX discord, we will help you.","preparation#Preparation":"You need to provide a USB Type-C cable to plug into the Manta that can provide 5V output. We recommend USB-Type A to Type C cables.\nSome Power Delivery chargers may output more than 5V via USB-C to USB-C type cables that in turn could burn out your M8P. Some also won't negotiate enough power to run the M8P at all. See the (Troubleshooting) section for more details.\nIn addition, some PC USB ports don't have enough power to run the Manta plus the EBB, causing random issues. USB 3.0 ports should be OK but older USB 2.0 ports might be problematic as they are limited to 500 mA of current.","wiring#Wiring":"We strongly recommend flashing the M8P and the EBB before installing them into the printer. Wire them as shown.\nThis pic is M8P V1. For V2 the only difference is the Canbus port position has changed.\nDo not connect the red and black wires on the Canbus cable or this will short out 5V to ground and let the magic smoke out. Do not leave them dangling as shown in the picture above. It is better to insulate the end of the red and black wires by tape or some other means to prevent accidental contact between the two wires, or between the wires and the Manta.\nConnect the green and yellow Canbus data wires to the Manta. This picture shows the header on the Manta V2 where the connection is made.Next we need to install some jumpers on the Manta and EBB so the two boards can be flashed. Note that there are three different sizes of jumpers so make sure you use the right size for each connection. The two largest sizes are packaged with the Manta for use on that board. The smallest size (circled in red below) are packaged with the EBB and used exclusively with it. The EBB jumpers can be hard to find: look for them mixed in with some connectors and pins for that board.\nThe jumpers should be the same width as the headers they plug in to and should fit snugly. Using the wrong-sized jumper has been the source of numerous problems because of the intermittent connection that results.\nConnect the following jumpers and leave them connected until the checks at the end of this process are completed.\nV_USB (largest-sized jumper) and 120R (medium-sized jumper) on M8P\nUSB_5V and 120R on EBB SB (smallest-sized jumper)\nThis pic is made by @Westy_Pity_Da_Fool. It may be helpful in understanding the wiring. Note that while it isn't shown clearly here, you also need to plug a USB cable between the Manta and the EBB SB2209 as well.Wiring:\nUSB cable from computer or wall supply to the M8P USB-C port.\nUSB Type-A to Type-C Data cable from one of the M8P USB-A ports to the EBB SB USB-C port. It is best to use the one that came packaged with the Manta as this is known to work well.\nCanbus cable from EBB SB to M8P (Canbus two pin connector only. The red and black power wires should be taped off for safety.)","flash-cb1#Flash CB1":"Download the latest image name starting with CB1_Debian11_Klipper from the BTT GithubThen use balenaEtcher  to flash it into your TF card. You don't need to unzip the image.When the flash is done, replug the TF card in your PC. You should be able to access the BOOT partition on the card from your PC's file manager of choice.Edit system.cfg and change the WIFI setting to yours by replacing the values within the quotes (do not delete the quotes themselves).That's all. Now just eject the card from the PC, install the card to the M8P, and install the CB1 to the M8P.\nThe TF card must install to the SOC-CARD, not the MCU-CARD slot.\nIt takes more force than you'd expect to install the CB1 on the M8P. You will feel it snap into place when properly inserted. Visually inspect the CB1 after mounting to ensure that the CB1 is flush against the Manta on all four corners.\nNow power on and wait a few minutes, you should be able to see the CB1 IP address in your router.Use your browser to visit the IP address shown on your router. The Mainsail web interface should be displayed.","optional-update#[Optional] Update":"We recommend updating Klipper to the latest version before proceeding.","set-cb1-can-bridge-bitrate#Set CB1 Can Bridge Bitrate":"These instructions and many of those that follow are done on the CB1 itself. The CB1 is accessed via an SSH terminal interface. How you do this is up to you. You can use a program like Mobaxterm to give you a bit of a GUI interface, but most people choose to use the Command Prompt on Windows or a Terminal program on MacOS / Linux.\nWe use a $ symbol to show most of the single line commands you need to type into the command line (like the ssh command that follows). Commands that might generate a lot of output from the CB1 are preceded with something that looks like biqu@BTT-CB1:~, and will be followed by the expected output from the CB1 in various colors.\nUse ssh to access the CB1 from your PC:\n$ ssh biqu@192.168.2.10\nbiqu@192.168.2.10's password:biqu  (<-- Password will not be echoed to screen)\nYou might get a warning the first time you ssh into the CB1. Acknowledge any prompt and proceed as we know this connection is a safe one.\nIf it wasn't clear from the above above, the CB1 is accessed with the username biqu and password biqu.\nNext we need to make sure that the CB1 uses the proper Canbus data rate. This information is stored in a configuration file that we will edit with a simple editor called nano. The editor name is preceded by sudo, telling Linux that we want to run this as a superuser with unlimited powers and permissions.\n$ sudo nano /etc/network/interfaces.d/can0\nEnter the password biqu if prompted. Depending on which BTT image you are using, you might need to create this file from scratch or edit an existing file provided by BTT.  If the latter, change the bitrate value to 1000000 if necessary and any other values as required. Whether you ending up having to create this file or edit an existing file, it should look exactly like this when you are done.\nA single typo here can lead to tricky problems later.\nallow-hotplug can0\niface can0 can static\n    bitrate 1000000\n    up ifconfig $IFACE txqueuelen 1024\nSave the file within the editor with Ctrl-O and then Enter to acknowledge.","disable-unnecessary-services#Disable Unnecessary Services":"By default, the BTT image for the CB1 runs several background services that are not properly configured by default and will repeatedly fail and restart every few seconds.  One service called hostapd tries to turn your printer into a wireless hotspot.  The other service called klipper-mcu allows use of the CB1 processor's GPIO and SPI ports as if it was a second MCU on top of the one already built into the Manta. Neither of these services is required for our purposes, and disabling them will ease the workload on the CB1 and minimize spam in your error logs.Assuming you are still connected to your printer via ssh from the previous step, enter these two commands to disable the two services.\n$ sudo systemctl disable hostapd\n$ sudo systemctl disable klipper-mcu\nYour command and the resulting output should look like this:\nbiqu@BTT-CB1:~$ sudo systemctl disable hostapd\nSynchronizing state of hostapd.service with SysV service script with /lib/systemd/systemd-sysv-install.\nExecuting: /lib/systemd/systemd-sysv-install disable hostapd\nRemoved /etc/systemd/system/multi-user.target.wants/hostapd.service.\nbiqu@BTT-CB1:~$ sudo systemctl disable klipper-mcu\nRemoved /etc/systemd/system/multi-user.target.wants/klipper-mcu.service.\nIf you have no use for KlipperScreen (the software that supports the printer's touchscreen GUI), you can disable it now or in the future with:\n$ sudo systemctl disable KlipperScreen\nReboot the CB1 from the command line for these changes and those in the previous section to take effect:\n$ reboot","flash-m8p#Flash M8P":"If you run into a problem flashing the M8P in this section or the EBB in the next sections, check out the Troubleshooting section at the bottom of this page for ideas.\n$ cd ~/klipper\n$ make menuconfig\nThen set everything up as shown. Use the arrow keys to navigate and Enter to change selections. Enter will also take you into sub-menus indicated by --->\n[*] Enable extra low-level configuration options\n    Micro-controller Architecture (STMicroelectronics STM32)  --->\n    Processor model (STM32H723)  --->\n    Bootloader offset (128KiB bootloader)  --->\n    Clock Reference (25 MHz crystal)  --->\n    Communication interface (USB to CAN bus bridge (USB on PA11/PA12))  --->\n    CAN bus interface (CAN bus (on PD0/PD1))  --->\n    USB ids  --->\n(1000000) CAN bus speed\n()  GPIO pins to set at micro-controller startup\nPress Q to save and then run make from the terminal.\n$ make\nIf you realize you've run \"make\" with incorrect settings, you can always go back and do make menuconfig, then make again.\nThis will create the Klipper firmware file out/klipper.bin for the Manta.Next we will flash it to the Manta with DFU. To enter DFU mode, press on BOOT0 and click the RESET button (i.e. Press and hold BOOT0, press and release RESET, release BOOT0, all on the Manta).\nBoth the M8P here and the EBB later have the same USB ID when in DFU mode, so you should only ever put one of them in DFU mode at a time or you risk flashing the wrong device.\nLet's verify that the Manta is in DFU mode:\n$ lsusb\nThere should be a DFU Mode device found. Record its ID, but normally it's 0483:df11. Now flash it.\n$ make flash FLASH_DEVICE=0483:df11\nYour command and the resulting output should look like this:\nbiqu@BTT-CB1:~/klipper$ make flash FLASH_DEVICE=0483:df11\n  Flashing out/klipper.bin to 0483:df11\nsudo dfu-util -d ,0483:df11 -R -a 0 -s 0x8020000:leave -D out/klipper.bin\ndfu-util 0.9\nCopyright 2005-2009 Weston Schmidt, Harald Welte and OpenMoko Inc.\nCopyright 2010-2016 Tormod Volden and Stefan Schmidt\nThis program is Free Software and has ABSOLUTELY NO WARRANTY\nPlease report bugs to http://sourceforge.net/p/dfu-util/tickets/\ndfu-util: Invalid DFU suffix signature\ndfu-util: A valid DFU suffix will be required in a future dfu-util release!!!\nOpening DFU capable USB device...\nID 0483:df11\nRun-time device DFU version 011a\nClaiming USB DFU Interface...\nSetting Alternate Setting #0 ...\nDetermining device status: state = dfuIDLE, status = 0\ndfuIDLE, continuing\nDFU mode device DFU version 011a\nDevice returned transfer size 1024\nDfuSe interface name: \"Internal Flash   \"\nDownloading to address = 0x08020000, size = 31336\nDownload\t[=========================] 100%        31336 bytes\nDownload done.\nFile downloaded successfully\ndfu-util: Error during download get_status\nFailed to flash to 0483:df11: Error running dfu-util\nIf the device is already in bootloader mode it can be flashed with the\nfollowing command:\n  make flash FLASH_DEVICE=0483:df11\n  OR\n  make flash FLASH_DEVICE=1209:beba\nIf attempting to flash via 3.3V serial, then use:\n  make serialflash FLASH_DEVICE=0483:df11\nmake: *** [src/stm32/Makefile:100: flash] Error 255\nIf it shows like this, then you have flashed it successfully,Now click the RST button on the Manta to restart the M8P (it won't restart CB1).Check M8P Can uuid:\n$ python3 lib/canboot/flash_can.py -q\nYour command and the resulting output should look like this:\nbiqu@BTT-CB1:~/klipper$ python3 lib/canboot/flash_can.py -q\nResetting all bootloader node IDs...\nChecking for canboot nodes...\nDetected UUID: 4b94c57be78e, Application: Klipper\nQuery Complete\nRecord your M8P can uuid. It is 4b94c57be78e in this example. Yours should be different.","flash-canboot-to-ebb-by-usb#Flash Canboot to EBB by USB":"If you didn't do it at the start of this process, plug the USB-5V and 120R jumpers on the EBB and connect it to the M8P via a USB-A to USB-C data cable like that provided with the Manta.As noted in the introduction, we need to flash Canboot to the EBB before we flash Klipper to it.\n$ cd ~\n$ git clone https://github.com/Arksine/CanBoot\n$ cd CanBoot\n$ make menuconfig\nCanboot was recently renamed to Katapult. Read one as the other and you'll be fine.\n(Top) \n                        CanBoot Configuration v0.0.1-41-gffd8ac6\n    Micro-controller Architecture (STMicroelectronics STM32)  --->\n    Processor model (STM32G0B1)  --->\n    Build CanBoot deployment application (Do not build)  --->\n    Clock Reference (8 MHz crystal)  --->\n    Communication interface (CAN bus (on PB0/PB1))  --->\n    Application start offset (8KiB offset)  --->\n(1000000) CAN bus speed\n()  GPIO pins to set on bootloader entry\n[*] Support bootloader entry on rapid double click of reset button\n[ ] Enable bootloader entry on button (or gpio) state\n[*] Enable Status LED       \n(PA13)  Status LED GPIO Pin\nPress Q to save and then run make from the terminal.\n$ make\nHold down the BOOT button and click RST on the EBB SB to put the EBB into DFU mode. Let's check if it worked:$ lsusbThere should be another DFU device 0483:df11Now we can flash Canboot to the EBB.\n$ dfu-util -a 0 -d 0483:df11 --dfuse-address 0x08000000 -D ~/CanBoot/out/canboot.bin\nYour command and the resulting output should look like this:\nbiqu@BTT-CB1:~/CanBoot$ dfu-util -a 0 -d 0483:df11 --dfuse-address 0x08000000 -D ~/CanBoot/out/canboot.bin\ndfu-util 0.9\nCopyright 2005-2009 Weston Schmidt, Harald Welte and OpenMoko Inc.\nCopyright 2010-2016 Tormod Volden and Stefan Schmidt\nThis program is Free Software and has ABSOLUTELY NO WARRANTY\nPlease report bugs to http://sourceforge.net/p/dfu-util/tickets/\ndfu-util: Invalid DFU suffix signature\ndfu-util: A valid DFU suffix will be required in a future dfu-util release!!!\nOpening DFU capable USB device...\nID 0483:df11\nRun-time device DFU version 011a\nClaiming USB DFU Interface...\nSetting Alternate Setting #0 ...\nDetermining device status: state = dfuIDLE, status = 0\ndfuIDLE, continuing\nDFU mode device DFU version 011a\nDevice returned transfer size 1024\nDfuSe interface name: \"Internal Flash   \"\nDownloading to address = 0x08000000, size = 4468\nDownload\t[=========================] 100%         4468 bytes\nDownload done.\nFile downloaded successfully","flash-klipper-to-ebb-by-usb#Flash Klipper to EBB by USB":"Remember in the Introduction we said we were going to flash Klipper to both the Manta and the EBB?  We already did the Manta so now it is the EBB's turn.\n$ cd ~/klipper\n$ make menuconfig\n(Top) \n                             Klipper Firmware Configuration\n[*] Enable extra low-level configuration options\n    Micro-controller Architecture (STMicroelectronics STM32)  --->\n    Processor model (STM32G0B1)  --->\n    Bootloader offset (8KiB bootloader)  --->\n    Clock Reference (8 MHz crystal)  --->\n    Communication interface (CAN bus (on PB0/PB1))  --->\n(1000000) CAN bus speed\n()  GPIO pins to set at micro-controller startup\nPress Q to save and then run make from the terminal:\n$ make\nSet EBB SB2209 to DFU mode by holding BOOT and clicking RST to enter DFU mode. Then run lsusbFlash it\n$ dfu-util -a 0 -d 0483:df11 --dfuse-address 0x08002000 -D out/klipper.bin\nNote how the address is 0x08002000 here vs the 0x08000000 when canboot was flashed. This prevents the first flash on the toolhead from being overwritten by the second","flash-checks#Flash Checks":"The python-based checks don't always work right, and some people have more luck than others getting them to work. Powering everything down and back up might increase your chances of getting them working. Generally speaking, if the flash commands complete successfully and the output looked as expected, it should be OK.\nCanboot Check\nDouble click the RST button on the EBB. The red LED should blink.\n$ cd ~/klipper\n$ python3 lib/canboot/flash_can.py -q\nIf it shows like this, then Canboot has flashed successfully.\nbiqu@BTT-CB1:~/klipper$ python3 lib/canboot/flash_can.py -q\nResetting all bootloader node IDs...\nChecking for canboot nodes...\nDetected UUID: 4b94c57be78e, Application: Klipper\nDetected UUID: 2f0b1ce14660, Application: CanBoot\nQuery Complete\nKlipper Check\nClick the RST Button on the EBB. The LED shouldn't blink anymore.\n$ python3 lib/canboot/flash_can.py -q\nIf it shows like this, Klipper has flashed successfully.\nbiqu@BTT-CB1:~/klipper$ python3 lib/canboot/flash_can.py -q\nResetting all bootloader node IDs...\nChecking for canboot nodes...\nDetected UUID: 4b94c57be78e, Application: Klipper\nDetected UUID: 2f0b1ce14660, Application: Klipper\nQuery Complete\nAll flash work is done. Now 4b94c57be78e is your M8P uuid, and 2f0b1ce14660 is your toolboard uuid.Use these to replace the placeholder uuid values inprinter.cfg. You can use the text editor built into the Mainsail web interface to easily make these changes. This annotated screenshot points out the key parts of the interface you'll need to know about for this.\nYou should end up with something that looks like this in your printer.cfg file, replacing the canbus_uuid values for the Manta MCU and the EBB with your values.  When your edits are done, select \"SAVE & RESTART\" from the top right corner of the editor.\n#####################################################################\n#   UUID Setting\n#####################################################################\n[mcu]\ncanbus_uuid:4b94c57be78e    \n[mcu EBBCan]\ncanbus_uuid: 2f0b1ce14660\nFinally, remove the v_usb jumper on the M8P and usb_5v jumper on the EBB SB. Keep the 120R jumper on both the M8P and the EBB.","troubleshooting#Troubleshooting":"Problem: The Manta and the CB1 aren't powering up even though they are connected to a supply that should have lots of power.\nDid you install the V_USB jumper on the Manta?\nAre you using a USB-C power supply for a phone? Some USB-C power supplies will try to negotiate with the device they are connected to and this doesn't always work well for the Manta. Anker USB-C power supplies for phones are known to be problematic.\nProblem: I can't see the EBB Toolhead using lsusb after flashing the Manta but its Power LED is on.\nVerify that you are connecting the EBB via one of the two USB-A connections on the Manta V2. The USB-C port on the Manta isn't supported for flashing the EBB.\nVerify that you are using a USB data cable and not a charging cable\nTry a different cable. More than one person has had problems because of a bad cable.\nMake sure the USB-C cable is plugged firmly into the EBB. It will click into place when properly connected. If only pushed in halfway, it will provide power but won't provide data.\nProblem: I can't see the EBB Toolhead using lsusb after flashing the Manta and its Power LED is off.\nVerify that you connected the USB_5V jumper on the EBB with the smallest sized jumper packaged with the EBB\nProblem: I flashed the Manta board and I see an Openmoko entry for it with lsusb after doing so, but it disappears from lsusb after I reset the Manta or cycle power.\nThe Manta bootloader has probably been corrupted, possibly by flashing the EBB Canboot image to the Manta instead of the EBB by mistake. Follow these instructions on the BTT Github to restore the bootloader on the Manta.\nProblem: I flashed the Manta board and I see an OpenMoko entry for it with lsusb even after I reset the Manta or cycle power. I double checked my make menuconfig setup and that looks good too. But I get errors like this when I try to get the Manta UUID with flash_can.py.\nbiqu@BTT-CB1:~/klipper$ python3 lib/canboot/flash_can.py -q\nResetting all bootloader node IDs...\nChecking for canboot nodes...\nERROR:root:Can Flash Error\nTraceback (most recent call last):\n  File \"/home/biqu/klipper/lib/canboot/flash_can.py\", line 596, in main\n    loop.run_until_complete(sock.run_query(intf))\n<snip>\n  File \"/usr/lib/python3.9/asyncio/streams.py\", line 721, in readexactly\n    raise exceptions.IncompleteReadError(incomplete, n)\nasyncio.exceptions.IncompleteReadError: 0 bytes read on a total of 8 expected bytes\nDouble check your /etc/network/interfaces.d/can0 file for typos. It needs to look exactly like that shown in the section on Setting the CB1 Can Bridge Bitrate\nProblem: I am trying to flash the Manta / EBB but the system is not stable. The Canbus connection disconnects and reconnects, interfaces disappear and reappear, etc.\nYou might have a weak USB power supply. We have seen instances where a marginal supply will cause the Manta to drop in and out while the CB1 operates normally. Or the CB1 and Manta might operate OK but the setup becomes unstable when the SB2209 is connected. Switch to a power supply / USB port that can provide more current and see if the problem goes away.\nProblem: I am using a Raspberry Pi CM4 instead of the BigTreeTech CB1 and username: biqu, password: biqu does not work for me.\nSee the BTT manual. For this board it should be username: pi, password: raspberry"}},"/Firmware-Setting/sensorless-homing-m8p-v2":{"title":"Sensorless Homing Setup On M8P V2","data":{"introduction#Introduction":"Sensorless homing makes use of the stallguard feature built into the TMC2209 stepper drivers plugged into the Manta M8P for the A & B motors that drive the toolhead on X & Y. Canbus and the integrated Y-endstop / chamber temperature sensor in the MPX kits requires some changes from the standard sensorless homing procedure documented in the Voron site. Nevertheless, you still want to read that page over as much of it is still applicable. This writeup will focus more on the deltas from that writeup vs. detailing the procedure in full.Getting a basic understanding of how sensorless homing works now will be useful for setup and troubleshooting later. In short:\nThe physical endstop switches are either not installed (X-endstop on Stealthburner) or not connected (Y-endstop near A motor)\nThe stepper drivers plus a bit of configuration in printer.cfg provide a signal that is either Low in normal operation (endstop not triggered) or High (endstop triggered).\nThe signal from the stepper drivers gets to the Manta CPU via connection of something called the DIAG jumpers. This means three things in practice:\nFirst: The physical endstops must not be installed / connnected or they will interfere with the operation of sensorless homing.  The DIAG jumper connection takes the place of the physical endstop connection.\nSecond: The EBB SB2209 is no longer involved with homing at all. We will not install the X-endstop to the toolhead and we will completely remove the reference to this endstop in our printer.cfg\nThird: The wiring from the MPX Y-endstop / chamber thermistor will need to be modified so we can retain the chamber temperature function.","diag-jumper-installation#DIAG Jumper Installation":"This part is straightforward. You need to install the DIAG jumper for both the A & B steppers motors as shown in this picture. These jumpers are in addition to the other jumpers that you installed when you set up the Manta for flashing.\nThis picture shows the Manta V1 but the DIAG jumpers are in exactly the same place for Manta V2.  Note that the DIAG jumper connection requires the smaller of the two jumper sizes provided with the Manta by BTT.","wiring#Wiring":"","stealthburner--ebb-sb2209#Stealthburner / EBB SB2209":"The X-endstop on the Stealthburner can be removed / not installed. It probably doesn't do any harm to have it on and left connected because we will be removing all references to it in printer.cfg, but this is untested. A reason for leaving it connected might be if you wanted to switch back to physical endstops later.","y-endstop#Y Endstop":"What MPX calls the Y Endstop PCB also includes a very small thermistor that is used for measuring the chamber temperature. We want to retain this capability so we still want to install that PCB and we still need to run the wiring to it but we need to change the wiring around a bit from the default: we want to retain a ground connection to the PCB but have the endstop switch ignored. There are two equally-effective methods for this, and the choice is up to you.","method-1-cable-re-pinning#Method 1: Cable Re-pinning":"This method re-pins the the chamber thermistor JST connector for the ground connection needed by the Y Endstop PCB.  Refer to the picture below. The green lines illustrate the original MPX wiring. The blue lines indicate where we want to end up after re-pinning.On both the three pin connectors, ground is the middle pin. The \"Y Endstop PCB\" has both a thermistor (across pins 2 & 3) and a switch (across pins 1 & 2). Re-pin the middle wire (“4”) from the \"Y-Endstop\" connector to “2” on the \"Chamber Thermistor\" connector. This relocates the Ground to the thermistor connection so that the M8P can read it. The wiring should now match the blue lines. The \"Chamber Thermistor\" will plug in to its original spot on the Manta. The \"Y Endstop\" connector can be left disconnected and tucked away in the PVC wiring channel in case you want to revert back to physical endstops later.","method-2-unused-endstop-connection#Method 2: Unused Endstop Connection":"Method 2 is simple: leave the connector pinouts as-is and plug the 3-pin \"Y Endstop\" connector into another unused endstop connector on the Manta board. That retains the ground connection to the Y Endstop PCB without otherwise interrupting motor operation.","initial-software-configuration#Initial Software Configuration":"","changes-to-printercfg#Changes to printer.cfg":"Before you run through the Voron Initial Startup Checks, you will need to make some software configuration changes to enable sensorless homing. We assume at this point that you know your way around the Mainsail interface well enough to upload new configuration files and edit existing files.Per the official sensorless homing writeup, we will do the following in our printer.cfg file:\nset the homing_retract_dist to 0\nset our X and Y homing_speed values to half of the rotation_distance\nmodify the endstop_pin values for [stepper_x] and [stepper_y]\nupdate the endstop_pin's to use the virtual_endstop and add failsafe pullups with the ^ symbol where required.\nThis is an example of the required changes for a 300mm Trident. There might be a few differences with other printers, but the endstop pin configuration is common between the different sizes and Trident / V2.4. We'll start with the Y endstop as it is the simpler of the two.  Edit your printer.cfg file as follows (remember that # indicates a comment line that Klipper ignores):Before:\n## Y Stepper on Motor2 (A Motor)\n[stepper_y]\n...\nrotation_distance: 40\nendstop_pin: ^PF3\n...\n##--------------------------------------------------------------------\nhoming_speed: 100  #Max 100\nhoming_retract_dist: 5\nhoming_positive_dir: true\n[tmc2209 stepper_y]\n...\nstealthchop_threshold: 0\nAfter:\n## Y Stepper on Motor2 (A Motor)\n[stepper_y]\n...\nrotation_distance: 40\n# endstop_pin: ^PF3\nendstop_pin: tmc2209_stepper_y:virtual_endstop\n...\n##--------------------------------------------------------------------\nhoming_speed: 20  #Max 100\nhoming_retract_dist: 0\nhoming_positive_dir: true\n[tmc2209 stepper_y]\n...\nstealthchop_threshold: 0\ndiag_pin: ^PF3\ndriver_SGTHRS: 255 # 255 is most sensitive value, 0 is least sensitive\nAs the Voron guide suggests, the Y motor now has a homing_speed half that of rotation_distance, homing_retract_dist is set to 0, and the endstop_pin on the y-axis is now configured to be a virtual_endstop. In addition, the [tmc2209 stepper y] section contains a diag_pin value that is cut and pasted from the [stepper_y] section, and there is a new value driver_SGTHRS set to its most sensitive value of 255.\nNot reducing the homing_speed as shown above may result in sensorless homing not working at best, and your printhead slamming into a rail at high speed with your motors grinding against the belts at worst.\nNow let's change the x-axis, and here is where it gets a bit tricky.Before:\n## X Stepper on Motor1(B Motor)\n[stepper_x]\n...\nrotation_distance: 40\nendstop_pin: ^EBBCan: PB6\n...\n##--------------------------------------------------------------------\nhoming_speed: 100   #Max 100\nhoming_retract_dist: 5\nhoming_positive_dir: true\n[tmc2209 stepper_x]\n...\nstealthchop_threshold: 0\nAfter:\n## X Stepper on Motor1(B Motor)\n[stepper_x]\n...\nrotation_distance: 40\n# endstop_pin: ^EBBCan: PB6\nendstop_pin: tmc2209_stepper_x:virtual_endstop\n...\n##--------------------------------------------------------------------\nhoming_speed: 20   #Max 100\nhoming_retract_dist: 0\nhoming_positive_dir: true\n[tmc2209 stepper_x]\n...\nstealthchop_threshold: 0\n# Must connect DIAG pin to M1-Stop on Manta (^PF4), and NOT ^EBBCan: PB6 !!!\ndiag_pin: ^PF4\ndriver_SGTHRS: 255 # 255 is most sensitive value, 0 is least sensitive\nThese changes on X are like that made on Y except for the diag_pin value.  Why is ^PF4 specified here instead of cutting and pasting ^EBBCan: PB6  as we did on the Y axis???  Remember that our X axis limit switch is now the DIAG pin coming from TMC2209 stepper driver for the B Motor, which is \"Motor 1\" on the Manta Board. The EBB2209 toolboard is no longer involved in endstop detection. In fact, keeping the reference to ^EBBCan: PB6 in printer.cfg will cause this endstop to always show triggered, even when it isn't. But how do we know that ^PF4 is the right pin to specify???  We know from this picture from the BTT Manta Manual.","additional-configuration#Additional Configuration":"We will now add a new configuration file that contains variables and macros specific for homing X and Y using stallguard rather than physical switches.\nGo to this Github link and download @kyleisah's Sensorless-Homing.cfg to your PC (Discord reference)\nReview the variable definitions at the top of the file and make any changes you wish.\nTrident users probably want to change variable_first_homed_axis: from 'X' to 'Y': if the printhead happens to be at the front of the printer and X is homed first, the printhead will move all the way to the right and bump into the front-right leadscrew.\nUpload the file Sensorless-Homing.cfg to your printer where printer.cfg and all of the other configuration files are located\nEdit your printer.cfg file to include this configuration file. If you put it near the top of the file, it will look as shown below.\n[include mainsail.cfg]\n[include stealthburner_leds.cfg]\n[include Sensorless-Homing.cfg]\n...\nThe printer.cfg files provided by MPX include a [safe_z_home] section. Per the Voron Guide, we want to comment this out in printer.cfg well.  That section will look like this when you are done.\n# [safe_z_home]\n# home_xy_position:150,150\n# speed:100\n# z_hop:1\nBe sure to save the printer.cfg file and restart the Klipper firmware when you are done.","next-steps#Next Steps":"At this point, your printer is set up for sensorless homing for when you get to running the initial startup checks for your printer. In particular, the \"Endstop Check\" section will verify that all Endstops are open (not triggered). Because of the work you have done to this point, the QUERY_ENDSTOPS command should show\nx:open y:open z:open\nIf any of the endstops show as \"triggered\", you have made a mistake somewhere, either in the wiring or the software setup. Do not proceed further until you find the problem and fix it.\nThe \"Endstop Check\" section of that guide will in turn reference the Setting Up and Calibrating Sensorless XY Homing documentation. You'll need to pick up that guide from the section on Finding the right StallGuard threshold. Note that the section on Homing Macros from that page is already taken care of by the Sensorless-Homing.cfg file that we uploaded previously. Also, the steps in the Final Setup section have been taken care of already as well: we commented out the [safe_z_home] section previously and our printer.cfg file already contains a [homing_override] section because it is needed for Tap."}},"/Firmware-Setting/sensorless-homing-m8p-v1":{"title":"Sensorless Homing Setting On M8P","data":{"diag-jumper-setting#DIAG Jumper Setting":"You need to install the DIAG jumper on AB steppers like the pic shown. and unplug Y endstop cable.\nNotice: you need to remove Y endstop cable, and the chamber thermistor won't work in this case, you can plug the 3P connector to any other endstop port.","firmware-setting#Firmware Setting":"This firmware is used for 300 build, you may need to change it.\nThis section is from @Alex, he posted it on discord.\n#####################################################################\n#     X/Y Stepper Settings\n#####################################################################\n## X Stepper on Motor1(B Motor)\n[stepper_x]\nstep_pin: PE2\ndir_pin: !PB4\nenable_pin: !PC11\nmicrosteps: 64\nrotation_distance: 40\nhoming_speed: 20\nhoming_retract_dist: 0\nendstop_pin: tmc2209_stepper_x:virtual_endstop\nposition_min: 0\nposition_endstop: 300\nposition_max: 300\n##--------------------------------------------------------------------\nhoming_positive_dir: true\n[tmc2209 stepper_x]\nuart_pin: PC10\ninterpolate: False\nrun_current: 1.2\nsense_resistor: 0.110\nstealthchop_threshold: 0\ndriver_SGTHRS: 56\ndiag_pin: ^PF3 \n## Y Stepper on Motor2 (A Motor)\n[stepper_y]\nstep_pin: PF12\ndir_pin: !PF11\nenable_pin: !PB3\nmicrosteps: 64\nrotation_distance: 40\nhoming_speed: 20\nendstop_pin: tmc2209_stepper_y:virtual_endstop\nposition_min: 0\nposition_endstop: 300\nposition_max: 300\n##--------------------------------------------------------------------\nhoming_positive_dir: true\n[tmc2209 stepper_y]\nuart_pin: PF13\ninterpolate: False\nrun_current: 1.2\nsense_resistor: 0.110\nstealthchop_threshold: 0\ndriver_SGTHRS: 56\ndiag_pin: ^PF4","tuning#Tuning":"Clee has made a great manual for tuning, you can follow thatSetting Up and Calibrating Sensorless XY Homing"}},"/Firmware":{"title":"Universal Firmware","data":{"":"Klipper depends on a configuration file called printer.cfg that drives much of its operation.  However, the default file provided by BTT is not useful and will in fact cause Klipper to report an error instead.  Our printer.cfg files have all of the configuration information needed for our standard kits as long as you follow our wiring guide.You will need to download two files. They can be found in the respective Github repository for your particular printer.\nFor V2.4 printers, go to https://github.com/MagicPhoenix/MPX-VORON-24R2-CBT/tree/main/Firmware\nFor Trident printers, go to https://github.com/MagicPhoenix/MPX-VORON-TRIDENT-CBT/tree/main/Firmware\nThe first file to download will become your new printer.cfg file.  To get it:\nGo to the appropriate link above for your printer (V2.4 or Trident)\nDownload the configuration file that matches your printer size (300mm vs 350mm) and the version of Manta M8P that you have (V1 vs V2).  e.g. 300_printer_m8p_v2.cfg\nGet that file onto your printer.  Either\nrename that file to printer.cfg and upload it to the CB1 via the Mainsail interface, overwriting the old printer.cfg or,\nopen the file on your PC with your editor of choice to copy and paste the file contents into the existing printer.cfg.  No trace of the original printer.cfg file should remain.\nYou can use the Mainsail web interface to easily make these changes. This annotated screenshot points out the key parts of the interface you'll need to know about to do so.\nThe second file to download is required for the LEDs on the Stealthburner.  Download stealthburner_leds.cfg from the same place you got the first file and upload it to the printer via the Mainsail interface.  Do not change the filename this time around.If you ordered the Disco LEDs or Rapido hotend, you also need to follow Configuration for Specific Hardware to make further edits to your new printer.cfg file.  Note that the Chaoticlab CNC tap does not require any special software configuration.","slicer-settings#Slicer Settings":"","print_startprint_end-macros#print_start/print_end macros":"The print_start/print_end macros run some actions that are required before and after the actual printing. With the basic macros included in the printer.cfg, it will do the following:\nprint_start\nHome all axis\nLevel the bed (QUAD_GANTRY_LEVEL for v2.4 or Z_TILT_ADJUST for Trident)\nRehome the axis\nPark over the center of the bed\nprint_end\nTurns off the heaters\nParks the toolhead at the back\nTurns off fans\nIn order to trigger these macros, we need to tell our slicer to pass the commands along in the gcode. See the sections below for the location to add our custom gcode for different slicers.\nOrcaSlicer\nThe custom gcode settings are under Printer setting > Machine G-code (You will need to enable advanced settings to see it)Machine start G-code\nM190 S[bed_temperature_initial_layer_single]\nM109 S150\nPRINT_START\nM109 S[nozzle_temperature_initial_layer]\nMachine end G-code\nPRINT_END\nPrusaSlicer\nThe custom gcode settings are under Printer Setting > Custom G-code (You will need to enable Expert settings to see it)Start G-code\nM190 S[first_layer_bed_temperature]\nM109 S150\nPRINT_START\nM109 S[first_layer_temperature[initial_extruder]]\nEnd G-code\nPRINT_END\nSuperSlicer\nThe custom gcode settings are under Printer Setting > Custom G-code (You will need to enable Expert settings to see it)Start G-code\nM190 S[first_layer_bed_temperature]\nM109 S150\nPRINT_START\nM109 S{first_layer_temperature[initial_extruder] + extruder_temperature_offset[initial_extruder]}\nEnd G-code\nPRINT_END\nOnce you've got the basics down, you may want to look at this \"Better Print Start Macro\" by jontek2 on Github.","configuration-for-specific-hardware#Configuration for Specific Hardware":"","disco-led#Disco LED":"The Disco LED configuration is different depending on if you have a Manta V1 or V2.  The former has two pins that separately drive each stick, the latter has a single pin that drives both sticks connected in series.\nUncomment the lines (remove the # character) in the \"Disco LED\" section in the printer.cfg file.  For Manta V1 and its two drive pins, it should look something like this.    Update the chain_count values in each section to equal the number of LEDs in each stick if necessary.\nMost people will need to change the color_order value.  The BGRW setting below indicates a LED that supports a fourth, pure white channel that the Disco sticks generally don't have.  If your LEDs aren't working right or colors are wrong, try a color_order of RGB or GRB.\n[neopixel disco1]\npin: PD15\nchain_count: 25\ncolor_order: BGRW\ninitial_RED: 1.0\ninitial_GREEN: 1.0\ninitial_BLUE: 1.0\n \n[neopixel disco2]\npin: PB15\nchain_count: 25\ncolor_order: BGRW\ninitial_RED: 1.0\ninitial_GREEN: 1.0\ninitial_BLUE: 1.0\nFor Manta V2 and its single drive pin, it should look something like this, with the last half commented out.  Update the chain_count value in the top half to equal the total number of LEDs in both sticks if necessary.  The values in the bottom half are commented out so don't matter.\n[neopixel disco1]\npin: PD15\nchain_count: 50\ncolor_order: BGRW\ninitial_RED: 1.0\ninitial_GREEN: 1.0\ninitial_BLUE: 1.0\n \n# [neopixel disco2]\n# pin: PB15\n# chain_count: 25\n# color_order: BGRW\n# initial_RED: 1.0\n# initial_GREEN: 1.0\n# initial_BLUE: 1.0","klipper-neopixel#Klipper NeoPixel":"The Disco LED has some cool uses, such as using it as a progress bar for printing, indicating extruder temperature or printing speed.  You can check it out at the Klipper Neopixel Github.\nOur two Disco LEDs can be configured independently, so you can choose to use them for the same purpose or for different purposes. For example, you can use the left one to display extruder temperature and the right one to show print progress.","rapido-thermistor#Rapido Thermistor":"The Rapido has its own integrated thermistor. Specify ATC Semitec 104NT-4-R025H42G instead of the stock generic 3950 in your printer.cfg file.  In other words, change this\nheater_pin: EBBCan: PB13\nsensor_type: Generic 3950\nsensor_pin: EBBCan: PA3\nto this\nheater_pin: EBBCan: PB13\nsensor_type: ATC Semitec 104NT-4-R025H42G\nsensor_pin: EBBCan: PA3\nin printer.cfg."}},"/GENERAL-KIT/Assembly-Tips":{"title":"Assembly Tips","data":{"general-assembly-tips#General Assembly Tips":"The packing is designed by the assembly sequence. We strongly recommend not taking parts and pieces out of each layer. You can take every layer out but keep them as layers with parts intact.","electronics#Electronics":"","lrs-200-24-power-supply#LRS-200-24 Power Supply":"To make the wiring cleaner, the power supply is mounted differently from the official manual. Check our Print Guide for your particular printer for the files you need to print these mounts. They should look like this picture. Use 4x M4x6 BHCS to mount it.","nevermore-filter#Nevermore Filter":"The Nevermore filter included with the kit is the Nevermore V5 Duo. Please review these links before assembly.\nBOM on Github\nAssembly Instructions also on Github.\nPlenum Assembly Album\nThe plenum assembly album is very informative but it does not show some of the other things you need to do, like the installation of the heatset inserts. Note also that these instructions will require a soldering iron for connecting the two fans to its 2 pin JST power connector (the kit does not include a breakout board for this purpose).","pei--buildplate--heater#PEI / Buildplate / Heater":"The bed heater is pre-installed on the build plate but you need to install the magnetic sheet yourself. The PEI and magnetic plate included in our kits are slightly larger than the buildplate size on purpose, so that you don't have to align them precisely when placing the spring steel. After sticking them on, you can use a blade to trim off the excess part.This Nero3D video on YouTube shows how the magnetic plate can be applied. However, it is even easier if you take this advice in one of the comments:\nProTip™ for aligning the magnet: peel off a strip of the backing, but lay down the other end first while keeping the exposed adhesive strip a bit elevated (the backing usually takes care of that, unless you peeled of too much). Then you have not only 1 edge to properly align it, but 3. Then just brush from e.g. the aligned back/sides towards the exposed front strip, pressing it down perfectly aligned. And then you can continue like shown in the video.\nYou will need to cut holes in the magnetic sheet either before or after its application so you can fasten it to the bed frame later.\nThe MPX build plate includes a second thermistor for monitoring its temperature within Mainsail, and the MPX default printer.cfg files are preconfigured to read it. The thermistor attaches at the location shown below towards the back of the build plate. You can use a small amount of heatsink grease or thermal paste on its threads to improve its response time, but do note that its reading will still lag that of the standard heater thermistor by 5-10°C during warmup. Be careful not to over-tighten the thermistor or you will strip its threads.The two thermistors are cabled as follows:\nthe MPX cable labeled HE (HEater) connects to the pre-installed thermistor\nthe MPX cable labeled BP (Build Plate) connects to the second thermistor you install yourself","stealthburner#Stealthburner":"","main-body#Main Body":"For the CW2 thumb screw washer, you need to use a 3x7x0.5 washer instead of the black washer supplied in the kit with all of the extruder components. The black washer is too large for the hole in the guilder arm and won't allow the thumbscrew to put proper tension on the filament.\nThe Stealthburner Manual does not document how to set the Anti-Squish Thingymajig. Some people also have trouble setting the gear meshing on the extruder's pancake motor. Watch these two video's from Dr. Dave on how to set these things up.\nHow to set the gear mesh in a Voron Clockwork 2 Extruder\nVoron Clockwork 2 Guidler Anti-Squish Thingymajig Adjustment","tap#Tap":"Be aware of the following when building Tap:\nAt time of writing, the official Voron Assembly manual for Tap was last released in 2022 and does not document the significant changes to its design since then. Note also that the official Voron manual for the Stealthburner shows the X-carriage for the standard Stealthburner design and not for Tap at this time (March 2024).\nTo get around this, you will want to follow the latest errata documentation on Github to build Tap, currently for the R8 version as of March 2024.\nSome glues like Cyanoacrylate (CA glue / Krazy Glue) and some epoxies do not hold at high temperatures. A high temperature epoxy like J-B Weld Original is recommended for the powerful magnets in the Tap assembly.\nThe Tap rail needs to be cleaned and greased like all the other rails.","special-consideration-for-rapido-hotends#Special Consideration for Rapido Hotends":"The MPX Kit is available with your choice of several hotends. The Rapido option currently offered is the V2. Here's some things you need to know if you choose the Rapido.\nThe installation of the Rapido V2 in the Stealthburner is documented here on Github.\nThe Rapido V2 includes its own built-in heater and thermistor. You will not need to use the NTC 100K thermistor or the 24V 50W heater that MPX supplies with the kits regardless of the hotend you order. That all sounds great but...\nThe connector on the Rapido V2 thermistor doesn't fit on the SB2209.  You either need to splice a cable on with a proper connector or you need to crimp a new connector on to the Rapido thermistor wire. Crimping a new connector is very challenging as it is so small (JST-GH 1.25). Most people will splice a pigtail wire with a proper connector on for that reason. Note that you can sacrifice the MPX-supplied thermistor for this purpose."}},"/GENERAL-KIT/Troubleshooting":{"title":"Troubleshooting","data":{"i-feel-bad-about-the-crunchy-rails#I feel bad about the crunchy rails":"Our all rails are comes with preload, higher preload bearings never feel great since the balls are rolling under load at all times. But it would be helpful to your print quality.","my-cb1-doesnt-work-and-i-cant-get-ip#My CB1 doesn't work and I can't get IP":"Step A: Make sure the TF card is flashed and in the right slot. There's 2 TF card slovts on M8P.Step B: Check 3.3V, 5V, 12V LED on M8P, somewhere may short if any led doesn't work. remove all connecters from M8P and try again.","disco-led-doesnt-work#Disco LED doesn't work":"The disco cable connectors on each side are not same, make sure the label is right.","y-endstop-never-triggered-and-got-wrong-chamber-temp#Y Endstop never triggered and got wrong chamber temp":"It's not your fault, it's ours.There are wiring sequence errors in some Y endstop PCB cables.You can use a multimeter check it, If there are errors, you can try using tweezers or a similar tool to extract the terminals and reinsert them correctly. It usually happens on 1/3 pins.If you have any trouble with it please contact us we will sent a replacement.","tap-never-triggered#Tap never triggered":"It is highly likely that the issue is indeed caused by wiring sequence errors. In that case, you will need to replace the terminals in a similar way as the Y endstop. You can easily exchange it on tap side (the PH2.0 connector).If you have any trouble it please contact us to get a replacement.","timer-too-close-issue-and-klipper-shutdown#Timer too close issue and klipper shutdown":"It usually happens with OrcaSlicer.  At first make sure the wires are fine, you can check it with a multimeter.If wires are fine, you can try these:\nSet ARC G2/3 to bigger, like 0.2/0.3\nDisable the dynamic fan control of OrcaSlicer."}},"/GENERAL-KIT/What-Else":{"title":"What Else","data":{"what-else-do-you-need-to-build-our-kits-#What else do you need to build our kits ?":"A set of Hex key wrenches.\nA small cross-head screwdriver.\nA small flat-head screwdriver.\nGlue for magnets. Note that some glues like Cyanoacrylate (CA glue / Krazy Glue) and some epoxies do not hold at high temperatures. A high temperature epoxy like J-B Weld Original is recommended for holding powerful magnets in high temperature areas like Tap.\nA good quality TF card (larger than 8GB, recommended brands include SanDisk, Lexar, and other high-quality brands with a C10 rating or higher).\nDiagonal pliers and a knife.\nAcid-free carbon (for Nevermore, not necessary for the build).\nPower Cord.\nGrease. Any lithium base grease will work. (Voron recommends NLGI Grade 0 or 1.)\nThreadlocker - Medium Strength (Blue) (For Pulley grub screws)\nTape Measure for frame squaring.\nSet of metric caliplers or a good metric ruler (Machinist's scale)\nSoldering iron for heat insert tool provided with the kit (T-12 type) and Nevermore fan wiring.","recommended-additional-tools-and-supplies#Recommended additional tools and supplies:":"Multimeter\nTweezers for belt routing\nMachinist / Engineer's Square for squaring the frame\nLuer Lock Syringes for rail greasing.\nJST & Molex connector crimp tool for reterminating cables if necessary (e.g. IWISS IWS-2820M or Engineer PA-09)\nHeatsink compound or thermal paste for the installation of the second buildplate thermistor"}},"/GENERAL-KIT/Whats-This":{"title":"About the CBT Kit","data":{"cbt-comes-from-canbus--tap#CBT comes from Canbus + Tap":"The significance of a CBT kit is to offer a high-quality VORON kit at an affordable price by carefully selecting components, and having the latest VORON configuration, while avoiding the need to disassemble the build after completion.Believe me, you don't want to disassemble and reassemble your VORON, so we've included Canbus + Tap in one go.","difference-between-cbt-and-standard-voron#Difference between CBT and standard VORON":"Using the Canbus Toolboard EBB SB2209; In the past VORON toolheads needed more than 20 wires, Canbus only uses 4 wires.\nUmbilical; It doesn't use XY cable chains. This reduces the X axis weight which is helpful to a higher print speed.In this case we made a Y endstop PCB that allows an extra chamber thermistor.\nUsing Tap as default probe; This is easy to use, and removes the Z endstop.\nWith Manta+CB1, you no longer need a Raspberry Pi and RS-25-5.","available-upgrades#Available Upgrades":"Gates Pulleys/Idlers\nDisco Stick Set (2pcs) with wires\nSteel Y extrusion backers (powder cotated black)\nStainless steel 440C rails"}},"/GENERAL-KIT/Wiring-Guide":{"title":"General Wiring Guide","data":{"":"This page covers the wiring common to both the V2.4 and the Trident (Stealthburner, Disco LEDs, etc). Please also review the guides specific to your printer, either the V2.4 Wiring Guide or the Trident Wiring Guide.","before-you-start#Before You Start":"Make sure the 110V/230V switch on your LRS-200-24 power supply is in the right orientation.\nWe strongly recommend you flash the M8P/SB2209 before you install them. This usually saves you 2 hours or more of work.  Check this page if you have a Manta M8P V2, or this page if you have a Manta M8P V1. Note that the kits have been shipping with V2 since late fall of 2023.","ebb-sb2209-toolhead#EBB SB2209 Toolhead":"","jumpers#Jumpers":"There are three jumpers that must be installed on the toolhead: two to select the fan voltage and one to select the 120 ohm resistor that terminates the Canbus.","x-endstop--voron-tap#X Endstop & Voron Tap":"The X-axis limit switch and Voron Tap plug into the SB2209 as shown. Note that if you elect to use sensorless homing, the limit switch must not be installed.","ntc100k#NTC100K":"There's some glue on the NTC100K thermistor's connector that may interfere with the CW2.  In this case, you can try to remove some glue or cut a small gap there. Note that the NTC100K is not used if you ordered the Rapido hotend since it has its own thermistor built in.This image shows the SB2209 installed on the body of the Stealthburner. Note that the heatsink is mounted not to the processor but to a bare area of the board near the top-right corner.","optional-printed-part#Optional Printed Part":"BIGTREETECH has modified printed parts for the CW2 main body and cable cover. They can improve the fit of the SB2209 within the Stealthburner.\nBIGTREETECH SB2209 Github STLs\nMain Body EBB\nCable Cover EBB","ebb-sb0000-expansion-board#EBB SB0000 Expansion Board":"Be extremely careful when plugging the expansion board into the SB2209 Toolhead. It is not difficult to be \"off by one\" on the 14-pin connector when plugging these two boards together. Doing so will burn out a small level shifter on the expansion board required for the LEDs to work.\nThe Stealthburner LEDs and both fans plug into the expansion board that in turn plugs into the SB2209 toolhead board. The small holes on the plastic connectors that show the connector face away from the board when the polarity is correct.","optional-disco-wiring#(Optional) Disco Wiring":"This portion of the wiki only discusses the wiring. The changes you need to make to your printer.cfg file so that the LEDs will be recognized by Klipper are detailed in the Firmware Guide\nYou need to use the modified Z_belt_cover STL file if your printer is a V2.4. Check our V2.4 Print Guide for details. If you are using the MPX Ultra Z Belt, it also works.\nNotice the wire label on the cable of both ends. The cable is directional.  The side labeled DIN is the IN port. The cable from the Manta M8P should go in the DIN side.\nBe careful here. Connecting the cable from the Manta to the wrong pin on the Disco LEDs, or mixing up the GND and 5V lines can permanently damage the LEDs.\nThe wiring to the Disco LEDs depends on if you have a Manta V1 or V2.  Again, the kits have been shipping with V2 since late fall of 20223.","disco-wiring-for-manta-m8p-v1#Disco wiring for Manta M8P V1":"This image shows the wire routing for an M8P V1 on a V2.4 printer.  The routing is similar for a Trident.  The Manta M8P V1 has two separate ports for controlling each LED stick, so the wiring of the two is separate.","disco-wiring-for-manta-m8p-v2#Disco Wiring for Manta M8P V2":"If you have the M8P V2.0, you need to connect the Disco in a daisy chain configuration, as M8P V2 only has one RGB port. The long cable from the M8P connects to the DIN side of the first stick. Then another cable connects the DOUT of the first stick to the DIN of the second stick.\nAgain, getting this wiring wrong can permanently damage the LEDs.","wiring-covers#Wiring covers":"Use extrusion covers to hide the wires to the Disco sticks. They can also be used to hide the gantry stepper wires."}},"/GENERAL-KIT/FAQ":{"title":"Frequently Asked Questions","data":{"":"Q: Why is it so cheap? Are you guys cutting corners?A: There is a reason why this problem appears on the FAQ, CBT Kit has a price difference of approximately $300 compared to our previous kit. These come from adjustments to our shipping strategy (yes, in the past, part of the shipping cost was displayed in the product price, which made it look like it was less expensive), as well as cost savings from switching to non-Misumi extrusions and synchronous pulley/idlers/rails.Q: Will these changes result in any difference in quality?A: There is almost no difference in the extrusions, and the difference in printing between non-Gates and Gates idlers/pulleys is also minimal, almost negligible. However, it is true that Gates is of higher quality. As for the rails, as long as you do not live in a damp environment, the black rails are also not prone to rust, as they have a black anti-rust coating. Another part of the cost savings comes from the reduced SKU count. In the past, the customizable options brought us too much pressure.Q: Can CB1 replace a Raspberry Pi?A: Yes, there is indeed a performance gap between them, but CB1 is fully capable of running Klipper and no longer requires an RS-25-5, which saves us another part of the cost.Q: Is it difficult to set up the CAN bus?A: For beginners, there may be some issues with setting it up. For this reason, we have created detailed documentation for flashing the firmware. You can refer to it, and if it doesn't work, you can contact us for assistance.Q: Which upgrades are worth recommending?A: Personally, I would recommend the Disco Stick, 800W Heater, and Steel Y Extrusion Backers.Q: Why is there only Y Extrusion Backers? Where is X?A: In both V2.4 and Trident, the X rail is mounted on the side, which causes no thermal expansion to affect the vertical direction. Similarly, adding weight to the X axis is not a good idea as it will significantly affect your Y acceleration, and therefore your printing speed and quality.Q: Why are the backers made of steel instead of titanium?A: Their effect is exactly the same, and you can find more information about it here."}},"/Maintenance/Linear-rail-lubrication":{"title":"Linear Rail Lubrication","data":{"to-start#To start:":"We are NOT building a spaceship, so relax.Under light load conditions, such as 3D printers, we don't need to pay too much attention on this.","recommened-lube#Recommened Lube:":"Generic White Lithium Grease\nThey are very cheap and easy to source\nMobil EP 2 Grease\nThe most common one, you should be able to source it on Amazon or a local store.\nSuperlube\nThe type of lubricating grease is not as important as we thought, $5/ounce of grease and $50/ounce of grease do not bring significant changes.","lube-rails#Lube Rails":"","by-the-surface-of-rail-recommended#By the surface of rail (Recommended)":"Just apply some grease on the top/side surface of the rails, especially the grooves on the side.Slide the carriager back and forth a few times to allow the grease on the surface of the rail to enter the carriager and evenly coat the guide rail.","by-carriage-oil-hole#By carriage oil hole":"The hole of the carriage is blocked by the dust block by default, but you use use an injector to do it.After that you can use the injector to insert grease."}},"/Maintenance/Spare-Parts":{"title":"Recomended Spare Parts","data":{"printed-parts#Printed Parts":"Having spares of these parts on hand can be extremely helpful if something breaks or gets damaged.","tap#Tap":"(Not applicable to CNC tap users)\n*Tap_Center\n*Tap_Center_Left\n*Tap_Center_right\n*Tap_front\n*Tap_Upper_PCB","stealthburner#Stealthburner":"*Tool cartridge (Both Pieces)","clockwork-2-extruder#Clockwork 2 Extruder":"*Guildler_a\n*Guilder_b\n*Latch\n*Latch Shuttle","non-printed-parts#Non printed parts":"*Spare nozzles appropriate to your hotend.\n*Spare Thermistor appropriate to your hotend.\n*Connectors and crimp pins for the various connections. (You should have plenty left over from your kit) OR a set of pre crimped wires and connectors."}},"/Maintenance/Standard-Maintenance-Cycle":{"title":"Standard Maintenance Cycle","data":{"common-parts-excl-toolhead#Common Parts (excl. Toolhead)":"","first-100-hours-printing#First 100 hours printing":"Check Belt tension\nCheck if the bolts are tightened (mainly XY Joints and A/B Drivers)","cycle-maintenance#Cycle Maintenance":"Part\tCheck Cycle (hours)\tReplace Cycle (hours)\tBelt tension\t1000\t\tbolts tightened\t1000\t\tLube rails\t1000\t\tPTFE tube (From spool to toolhead 4x3 one)\t\t1000","service-life-of-motion-parts#Service life of motion parts":"Belts: it should be fine after 5000hrs printing under 400mm/s @ 10K acc.\nPulleys: usually maintenance free.\nBearings: it should be fine after 3000hrs printing under 400mm/s @ 10K acc.\nIdlers: it should be fine after 3000hrs printing under 400mm/s @ 10K acc.\nThere may be abnormal noises from bearings or idlers after 3000hrs printing, in this case you can try to apply a bit more grease.","toolhead-maintenance#Toolhead Maintenance":"Depending on the filament used, there may be significant differences\nParts\tReplace Cycle(normal filaments)\tReplace Cycle(fibre filaments)\tNozzle - Standard\t50kg+\t2kg @ max\tNozzle - Hardened Steel\t200kg+\t5kg\tNozzle - DLC\t200kg+\t10kg+\tExtruder Gear - Standard\t200kg+\t20kg+\tExtruder Gear - RNC\t200kg+\t50kg+\tExtruder Gear Bearing (MR85)\t100kg+\t100kg+","handling-unexpected-situations#Handling Unexpected Situations":"","spaghetti#Spaghetti":"Check List:\nCheck whether there is filament stuck in the hotend fan (Important)\nCheck whether there is filament stuck in the Z Drive"}},"/Troubleshooting/corexy-direction":{"title":"CoreXY Direction Correction Process","data":{"":"Case 1 : X,Y control reversed, XY motion oppositeA: Reverse X dir pin.Case 2: X,Y control reversed, XY motion correctlyA: Reverse Y dir pin.Case 3: X,Y control reversed, X motion correctly, Y motion reversedA: Reverse X dir pin. Then exchange XY stepper.Case 4: X,Y control reversed, X motion reversed, Y motion correctlyA: Reverse Y dir pin. Then exchange XY stepper.Case 5: X,Y control correctly, XY motion oppositeA: Reverse XY dir pin.Case 6: X,Y control correctly X motion correctly, Y motion reversedA: Exchange XY stepper.Case 7: X,Y control correctly X motion reversed, Y motion correctlyA: Exchange XY stepper. Then reverse XY dir pin."}},"/Sound":{"title":"Adding Sound","data":{"introduction#Introduction":"The BigTreeTech CB1 processor board and Manta controller do not have built-in support for audio output. However, the CB1 Linux kernel has USB audio support compiled into it as a module. This mod takes advantage of that and uses a low-cost USB sound card to give your printer the ability to play audio files in WAV, FLAC, and MP3 formats.\nThis guide assumes some familiarity with ssh'ing into your printer, working on the Linux command line, and adding / editing files on the CB1 processor. These are skills you should have picked up when initially setting up your printer so this mod should be doable for most people.","hardware#Hardware":"You'll need the following hardware for this mod:\nA USB external sound card adapter that can work in Linux natively without any special drivers. The UGreen USB Sound Card adapter works well, is inexpensive, and is widely available from sites like AliExpress & Amazon. Other adapters might work but are untested.\nA small speaker or two suitable for mounting within your electronics bay or mounting to the printer. Most USB adapters are meant to drive a set headphones, so an amplified set of speakers doesn't hurt if you want lots of volume.\nA 3.5mm audio cable suitable for connecting up your speakers.  If you are using speakers with bare terminals, the plug and its wire salvaged from an old pair of headphones works fine.\nWire up the 3.5mm audio cable up to your speakers. How you do this depends on the hardware you've pulled together. If you are wiring an old headphone cable to a set of speakers with bare terminals, use this picture as a guide to how the pins on the 3.5mm plug should be hooked up to your speakersNext, plug the 3.5mm plug into the headphone jack of the USB sound card adapter.  If you are using the UGreen adapter or something similar with a microphone jack, it will go unused. Finally, plug the USB adapter into one of the USB 2.0 ports on the Manta.That's it! The hardware is done. Next up: install the necessary software.","software#Software":"We need a way for Klipper to interface to the USB sound card adapter. We use the G-Code Shell Command Extension for Klipper that lets you \"execute Linux commands or even scripts from within Klipper with custom commands defined in your printer.cfg.\"  If you are using KIAUH (the Klipper Installation And Update Helper), then you are already good to go.  If not, we'll install just a couple files to provide the minimum functionality we need.\nDownload the file gcode_shell_command.py from Github and save it to your PC.\nTransfer the file to your printer's /home/biqu/klipper/klippy/extras directory using FileZilla, WinSCP, or your file transfer program of choice.\nDownload the file shell_command.cfg from Github and save it to your PC.\nTransfer the file to your printer's /home/biqu/printer_data/config directory as above. Note that this is the same directory that holdes your printer.cfg file.\nRestart Klipper so it picks these new files up.\nThat is it for the software side of things. The last part is configuration and testing, and it is where things get a little trickier.","configuration-and-testing#Configuration and Testing":"","gather-some-information#Gather Some Information":"With everything powered up and the USB audio adapter plugged into a USB 2.0 port on the Manta, use ssh to access the CB1 from your PC and execute the following command. We'll first verify that Linux sees the adapter.\nbiqu@Voron:~$ dmesg |grep C-Media\nYour command and the resulting output should look something like this. Note that the \"USB Audio Device\" has been recognized.\nbiqu@Voron:~$ dmesg |grep C-Media\n[18268.592541] usb 2-1.2: Manufacturer: C-Media Electronics Inc.\n[18268.616775] input: C-Media Electronics Inc. USB Audio Device as /devices/platform/soc/5200000.usb/usb2/2-1/2-1.2/2-1.2:1.3/0003:0D8C:0014.0002/input/input2\n[18268.675128] hid-generic 0003:0D8C:0014.0002: input,hidraw0: USB HID v1.00 Device [C-Media Electronics Inc. USB Audio Device] on usb-5200000.usb-1.2/input3\nIf it doesn't show up, make sure all your USB connections are good. Some adapters like the UGreen have a small LED that lights up when power is applied.Linux audio on the CB1 is handled by something called Alsa. We will use Alsa's aplay command to verify that it also recognized the USB audio adapter. The aplay command should already be installed on your CB1, as are the rest of the utilities we'll be using going forward.Execute the following command:\nbiqu@Voron:~$ aplay -l\nYou should see something like this when the command is run. Note that the USB Audio Device is recognized as card 2, at least in this example. Note the card number for your setup - we'll need it soon.\nbiqu@Voron:~$ aplay -l\n**** List of PLAYBACK Hardware Devices ****\ncard 0: sndahub [sndahub], device 0: Media Stream sunxi-ahub-aif1-0 [Media Stream sunxi-ahub-aif1-0]\n  Subdevices: 1/1\n  Subdevice #0: subdevice #0\ncard 0: sndahub [sndahub], device 1: System Stream sunxi-ahub-aif2-1 [System Stream sunxi-ahub-aif2-1]\n  Subdevices: 1/1\n  Subdevice #0: subdevice #0\ncard 0: sndahub [sndahub], device 2: Accompany Stream sunxi-ahub-aif2-2 [Accompany Stream sunxi-ahub-aif2-2]\n  Subdevices: 1/1\n  Subdevice #0: subdevice #0\ncard 1: Codec [H616 Audio Codec], device 0: CDC PCM Codec-0 [CDC PCM Codec-0]\n  Subdevices: 1/1\n  Subdevice #0: subdevice #0\ncard 2: Device [USB Audio Device], device 0: USB Audio [USB Audio]\n  Subdevices: 1/1\n  Subdevice #0: subdevice #0\nNow we'll run the aplay command again but with a capital \"L\" instead of a lower case \"l\". This gives us a lot more detailed information.Execute the following command:\nbiqu@Voron:~$ aplay -L\nA bunch of stuff will scroll by. Only an excerpt showing the important stuff is shown below.\nnull\n    Discard all samples (playback) or generate zero samples (capture)\ndefault\nhw:CARD=sndahub,DEV=0\n    sndahub, Media Stream sunxi-ahub-aif1-0\n    Direct hardware device without any conversions\n...\nplughw:CARD=Device,DEV=0\n    USB Audio Device, USB Audio\n    Hardware device with all software conversions\nsysdefault:CARD=Device\n    USB Audio Device, USB Audio\n    Default Audio Device\nfront:CARD=Device,DEV=0\n    USB Audio Device, USB Audio\n    Front output / input\nsurround21:CARD=Device,DEV=0\n    USB Audio Device, USB Audio\n    2.1 Surround output to Front and Subwoofer speakers\n...\nThe important part here is the line starting with front showing up for USB Audio Device. This represents the two channel audio output from the USB audio adapter. There are a bunch of other formats supported by the internal audio chip that we can safely ignore. What you are particularly interested in is the text on that line prior to the comma. So for this example of front:CARD=Device,DEV=0, copy the text front:CARD=Device.","initial-audio-test#Initial Audio Test":"Now we'll see if we can get some audio out of this setup with the speaker-test command. Execute the following command with the text you just copied following the -D with no space in between.\nbiqu@Voron:~$ speaker-test -Dfront:CARD=Device -c 2 -s 1 -t sine -f 440\nIf everything went right so far, you will hear a 440 Hz sinewave tone (-t sine -f 440) on Device front:CARD=DEVICE channel #1 (-s 1) meaning the Left channel. -s 2 would test the right channel.  You should also see something in the terminal that looks like this.\nbiqu@Voron:~$ speaker-test -Dfront:CARD=Device -c 2 -s 1 -t sine -f 440\nspeaker-test 1.2.4\nPlayback device is front:CARD=Device\nStream parameters are 48000Hz, S16_LE, 2 channels\nSine wave rate is 440.0000Hz\nRate set to 48000Hz (requested 48000Hz)\nBuffer size range from 96 to 262144\nPeriod size range from 48 to 131072\nUsing max buffer size 262144\nPeriods = 4\nwas set period_size = 65536\nwas set buffer_size = 262144\n  - Front Left\nIf you heard a sound, congratulations! If not, go back and very carefully check your work. Unfortunately there is a lot of complexity in all of this so giving a few specific troubleshooting tips is difficult especially if you pick something different than the recommended UGreen adapter. Google and Discord are your friends.","alsamixer-setup#Alsamixer Setup":"The speaker-test program is very low level. The next step is to get the higher level Alsa stuff working. Time to fire up alsamixer as shown here.\nbiqu@Voron:~$ alsamixer\nAlsamixer can display all the sound-related devices it knows about, and will most likely default to something relatively complicated called sndahub listed in the top left hand corner of its window as shown below. The first thing you want to do is review some of the basic Alsamixer commands shown in the top right of its window. Hit F1 to display the Help window to familiarize yourself with the available commands and then Esc when you are done.Next you want to hit F6 to select the appropriate sound card. You should see a display like that shown below. Use the arrow keys to highlight USB Audio Device (shown here as Sound Card 2) and Enter to select it. Note that Sound Card 2 here is a match with the card number from aplay -l that we ran a while back.Select F5 to view all of the available configuration parameters for the USB Audio Device. Use the Left & Right arrow keys to move around between Speaker, Mic, etc and the Up & Down arrow keys to set the levels for each.  The m key will mute a given element. Mess around until you end up with the settings shown below.\nSpeaker is set to 100% (at least to start with) and not muted. 00 will show at the bottom of its vertical bar when the speak is not muted.\nThe two microphones are set to 0% and are muted (MM) if that setting is available\nAuto gain control should show as 00. This presumably means \"enabled\" and in fact cannot be changed on my adapter.\nThe end result should appear as shown below.\nOnce you're done, hit Esc to exit alsamixer.\nThis next step is critical!\nThe alsamixer settings have been set but they need to be stored so they will survive a reboot. Do that by executing the command\nbiqu@Voron:~$ sudo alsactl store\nThere is no feedback from this command if it ran successfully. If you see a message like\nalsactl: state_lock:125: file /var/lib/alsa/asound.state lock error: File exists\nthat probably means you didn't run it with sudo.","creating-asoundconfig#Creating asound.config":"This step is even more critical than the last one!\nThe last part of the Linux sound setup is telling Alsa which sound card to use by default. This is specified in a file called /etc/asound.conf. It is not easy to understand so don't worry if you don't follow what it is doing. We're going to make it as simple as possible and move on.Use sudo plus your editor of choice (vim in this case) to create the Alsa configuration file asound.conf.\nbiqu@Voron:~$ sudo vim /etc/asound.conf\nThe contents of the file should be this. Note that card 2 is used here because the USB adapter has shown up as card 2 in all our previous steps. If the card shows as a different number for you (it probably shouldn't), use that instead. The rest of the file is basically magic.\npcm.!default {\n        type hw\n        card 2\n}\nctl.!default {\n        type hw           \n        card 2\n}\nIf you aren't familiar with any text editor on Linux, you could create a file called asound.conf on your PC and then transfer it to the /home/biqu directory on your printer with Filezilla / WinSCP. Then you could move that file to the right place with\nbiqu@Voron:~$ sudo mv asound.conf /etc\nWith all of that configuration done, reboot your printer from the Mainsail interface to make sure all the changes we've made have been picked up.","grab-some-sound-files-and-test-them-out#Grab Some Sound Files and Test Them Out":"Unlike Windows, Linux is case sensitive. Redalert.wav is a different file from redalert.wav. It will also greatly simplify your life if you don't use spaces in your filenames. Keep it simple.\nThis part is easy. We're going to create a directory to store the sound files that you can play either from the command line or via Klipper. Execute these two commands after ssh'ing back into the printer after the reboot in the previous step.\nbiqu@Voron:~$ mkdir sounds\nbiqu@Voron:~$ cd sounds\nYou now have a sounds directory and have changed into that. Now go and download a few WAV or MP3 files from somewhere onto your PC and transfer them to that sounds directory. A few suggested guidelines.\nIt is probably best to keep them short: think seconds long and not minutes long\nWAV files probably put a little less processing demand on the CB1 than MP3 files, though both seem to work OK\nRemember that Linux is case sensitive and spaces in file names are a pain. Keep everything lower case without spaces to minimize the chance of an error.\nWe are finally at a point where we can test this setup with a real audio file. Assuming a file named redalert.wav, enter this command, substituting with the name of your particular file (note that the Linux command line supports tab completion for file names)\nbiqu@Voron:~/sounds$ play redalert.wav -t alsa\nIf everything has been done correctly, you should hear your sound sample and see something similar to this in the terminal. You might get a warning like that shown below but usually the sound will play just fine anyway.\nplay WARN alsa: can't encode 8-bit Unsigned Integer PCM\nredalert.wav:\n File Size: 13.4k     Bit Rate: 120k\n  Encoding: Unsigned PCM  \n  Channels: 1 @ 8-bit    \nSamplerate: 11025Hz      \nReplaygain: off         \n  Duration: 00:00:00.90  \nIn:100%  00:00:00.90 [00:00:00.00] Out:39.7k [  -===|===-  ] Hd:0.6 Clip:0    \nDone.\nIf you heard a sound, congratulations once again! If not, go back and double-check your work. See if there are any error messages that give you a clue as to what isn't working. Try firing up alsamixer again and see that it comes up with the settings you created earlier.  Again, Google and Discord are your friends.","setting-up-printercfg#Setting Up printer.cfg":"We're now going to work from the Mainsail interface instead of an ssh shell into the CB1. Open your printer.cfg file from Mainsail and add the following line at the top of the file with the other include's that you'll have there already\n[include shell_command.cfg]\nNow paste the following code in around where you have the rest of your macros. You might notice that the PLAY_SOUND macro assumes the sounds folder in /home/biqu that we set up earlier.\nverbose is set to True in the code below to aid with troubleshooting. You can set it to False once everything is working right.\n# SOUND!\n[gcode_shell_command PLAYCMD]\ncommand: play -q\ntimeout: 5.\nverbose: True\n[gcode_macro PLAY_SOUND]\ngcode:\n  {% set cmdline = params.SOUNDFILE|default(\"redalert.wav\")|string %}\n  {% set cmdline = \"/home/biqu/sounds/\" + cmdline  + \" -t alsa\" %}\n  { action_respond_info('Commandline: %s' % (cmdline)) }\n  RUN_SHELL_COMMAND CMD=PLAYCMD PARAMS=\"{cmdline}\"\nWhile we are at it, let's set up a bit of delayed GCode so that an audio file is played one second after Klipper starts up.\n# Things to do when Klipper first starts up\n[delayed_gcode PRINTER_STARTUP]\ninitial_duration: 1\ngcode:\n    PLAY_SOUND SOUNDFILE=\"redalert.wav\"\nThe line above shows all you need to know to sprinkle sound clips throughout your printer.cfg file.\nPLAY_SOUND is the name of the macro\nSOUNDFILE= is passed the name of the audio sample you want to play. It's name is quoted and it must exist in /home/biqu/sounds. Again, remember that Linux is case sensitive.","final-testing#Final Testing":"After making the changes to printer.cfg in the previous section, select \"SAVE & RESTART\" from Mainsail's editor interface. If all went well...\nthe sample you provided in the delayed_gcode macro will play\nyou will have a PLAY SOUND macro listed with your other macros. Running the macro will play the default audio file specified within the code of that macro OR  you can click the Down Arrow button next to the macro name to play the file of your choice from the sounds directory in /home/biqu.\nyou can type something like PLAY_SOUND SOUND=\"redalert.wav\" in the \"Console\" section of the Mainsail Dashboard to play the sound file of your choice\nNow all that remains is to gather up more clips and sprinkle them throughout your printer.cfg file. Be creative and have fun!\nReddit thread on playing sounds with Klipperscreen. This also hints how you could get Klipper to speak arbitrary text rather than audio files you supply.\nThe Arch Linux Wiki entry for Alsa\nAlsa configuration file documentation"}},"/Troubleshooting/troubleshooting":{"title":"Troubleshooting","data":{"my-linear-rails-are-crunchy-stiff-gritty-etc#My linear rails are crunchy, stiff, gritty, etc.":"All of our rails come with a preload, higher preload bearings never feel great since the balls are rolling under load at all times. But this will be helpful to print quality.","my-cb1-doesnt-work-and-i-cant-get-an-ip#My CB1 doesn't work and I can't get an IP":"Step A: Make sure the TF card is flashed and in the right slot. Use the slot labeled SOC-CARD as there are 2 TF card slots on M8P.Step B: Check 3.3V, 5V, 12V LED on M8P, somewhere may have a short if any leds don;t work. remove all connecters from M8P and try again.","disco-leds-doesnt-work#Disco LEDs doesn't work":"The disco cable connectors on each side are not same, make sure the label is right. Cable goes to DIN on the Disco. When linking/chaining the cable goes from DOUT on one to to DIN on the other.","y-endstop-never-triggered-andor-getting-wrong-chamber-temps#Y Endstop never triggered and/or getting wrong chamber temps":"It's not your fault, it's ours.There are wiring sequence errors in some Y endstop PCB cables.You can use a multimeter check it. If there are errors, you can try using tweezers or a similar tool to extract the terminals and reinsert them correctly. It usually happens on 1/3 pins.If you have any trouble with it please contact us we will send a replacement.","tap-never-triggered#Tap never triggered":"It is highly likely that the issue is indeed caused by wiring sequence errors. In that case, you will need to replace the terminals in a similar way as the Y endstop. You can easily exchange it on tap side (the PH2.0 connector).If you have trouble with it, please contact us to get a replacement.","timer-too-close-issue-and-klipper-shutdown#Timer too close issue and klipper shutdown":"It usually happens with OrcaSlicer.  First make sure the wires are fine. You can check it with a multimeter.If wires are fine, you can try these steps:\nSet ARC G2/3 bigger, like 0.2/0.3\nDisable the dynamic fan control of OrcaSlicer."}},"/Tuning":{"title":"Initial Startup","data":{"":"If you are using sensorless homing, make sure before starting that the DIAG Jumpers have been installed on the Manta M8P.  That page also details the printer.cfg changes and additional setup work you'll need to do as well.\nPlease follow the Initial Startup Checks provided by the Voron Design Team.  It is a step-by-step guide to safely get your new printer up and running.  It includes things like:\nChecks for proper temperature reporting\nHeater and endstop checks\nHoming checks\nZ offset adjustment\nExtruder calibration\nAnd much more!","tuning#Tuning":"Ellis' Print Tuning Guide is a must-read for getting quality prints out of your new Voron. It is very detailed and applies to both the V2.4 and the Trident. It is strongly recommended that you follow this guide once you have your printer up and running.","typical-information#Typical Information":"These values are for a Voron V2.4.  Values for a Trident will be similar.\nChamber Temperature: with a buildplate temperature of 110°C, the chamber temperature will be around 60°C.\nVisual Fine Artifacts (VFA): Setting the outwall speed to greater than 200mm/s can effectively avoid VFA. We use 350mm/s on our own printer.\nInput shaper result: Typical X acceleration of 10000, Y acceleration of 5000."}},"/VORON-2.4-CBT-KIT/Assembly-Tips":{"title":"Assembly Tips","data":{"v24-assembly-tips#V2.4 Assembly Tips":"The kit's packaging is designed by the assembly sequence.  We strongly recommend not taking parts and pieces out of each layer. You can take every layer out but keep them as layers with parts intact.\nThese Assembly Tips are specific to the V2.4. You will also need to refer to the General Assembly Tips that are common to the V2.4 and the Trident. The Trident-specific assembly tips are here.","build-video#Build Video":"Westy made a great video on an entire V2.4 build. Check it out on YouTube!","layer-1#Layer #1":"Square frame extrusions\nBlack OpenBuilds 2020 90° corner\nVORON V2.4 fasteners kit","build-done#Build Done":"With the #1 layer parts, you should get this :","layer-2--3#Layer #2 & #3":"With these 2 layers, you are able to install Z Drive/Z rails and deck panel.After this there would be XY steppers left, keep them for the next layer.You may need M5 shims for mounting DIN rails, add 5x10x1 spacer to 4x M5x10 BHCS.","build-done-1#Build done":"","layer-4#Layer #4":"XY gantry extrusions and rails\ngantry pulleys/idlers/bearings\nbuildplate/PEI/heater","build-done-2#Build done":"","tips#Tips":"You may need to remove one or more sections of cable chains according to your build size.","layer-5#Layer #5":"This layer includes other all parts, including wires, electronic parts and toolhead parts etc.After this layer you should be able to print parts.","layer-6#Layer #6":"Panels. All clear panels and bottom/back black panel.","back-panel#Back Panel":"Follow our print guide.You need to apply 3mm thick foam tape on the edge of  Exhaust_cover.stl and you need to install 2xM3 inserts on this part.\nOnce again, remember to refer to the General Assembly Tips for those parts of the build common between the V2.4 and the Trident (Stealthburner, Tap, etc)"}},"/VORON-2.4-CBT-KIT/BOM-List":{"title":"Bom List","data":{"bom-list#BOM List":"Layer\tPart\tName\tQty\tNote\t#1\tFasteners kit - stainless steel\tM2x10 Self-tapping\t40\tSUS304\t\t\tM3x6 FHCS\t25\tSUS304\t\t\tM3x6 BHCS\t20\tSUS304\t\t\tM3x8 SHCS\t260\tSUS304\t\t\tM3x12 FHCS\t10\tSUS304\t\t\tM3x12 SHCS\t50\tSUS304\t\t\tM3x16 SHCS\t35\tSUS304\t\t\tM3x20 SHCS\t40\tSUS304\t\t\tM3x25 SHCS\t15\tSUS304\t\t\tM3x30 SHCS\t50\tSUS304\t\t\tM3x40 SHCS\t35\tSUS304\t\t\tM3x50 SHCS\t5\tSUS304\t\t\tM4x6 BHCS\t15\tSUS304\t\t\tM5x10 BHCS\t60\tSUS304\t\t\tM5x16 BHCS\t40\tSUS304\t\t\tM5x30 BHCS\t30\tSUS304\t\t\tM5x40 SHCS\t35\tSUS304\t\t\t3x7x0.5 Washer\t10\tSUS304\t\t\t5x10x1 Shim Ring\t60\tSUS304\t\t\tM3 Hexnut\t30\tSUS304\t\t\tM3 Roll-in T-Nut\t150\tSteel, Nickel plated\t\t\tM3 Hammer Head T-Nut\t100\tSteel, Nickel plated\t\t\tM3 Insert\t150\tBrass\t\t\tM4 Knurled Nut\t4\tSteel, Nickel plated\t\t\tM5 Hexnut\t30\tSUS304\t\t\tM5 Roll-in T-nut\t70\tSteel, Nickel plated\t\t\tM5 Hammer Head T-Nut\t50\tSteel, Nickel plated\t\tFrame\tMPX VORON 2.4 Frame Kit - Black\t1\tpre-drilled/tapped\t\t\tBlack OpenBuilds 2020 90° corner\t4\t\t\tTool\tInsert Tool\t1\t\t\t\t\t\t\t#2\tXYZ Steppers\tMOONS' MS17HD6P4200\t6\t\t\tLinear Rails\tMPX Black MGN9H Rail - 400mm\t4\t\t\tPulley/Idler/Bearing\tGT2 Pulley 20T 5ID 9W\t4\t\t\t\tGT2 Pulley 80T 5ID 6W [Black]\t4\t\t\t\tGT2 Idler 20T 5ID 9W\t4\t\t\t\tGT2 Pulley 16T 5ID 6W\t4\t\t\t\t625-2RS\t12\t\t\t\t5x60 D-Cut shaft\t4\t\t\tBelt\tGates 188-2GT-6 RF\t4\t\t\tMisc\tRubber Foot\t4\t\t\t\t\t\t\t#3\tPanels\tBlack ABS Deck Panel [3mm]\t1\t\t\t\t\t\t\t#4\tLinear Rails\tMPX Black MGN9H Rail - 400mm\t2\t\t\t\tMPX Black MGN12H Rail - 400mm\t1\tLight Preload\t\tBuildplate/Heater\tMPX 5083 Cast Aluminium Buildplate 305x305x8\t1\t<0.15 Flatness\t\t\tMPX 650W 350x350 Full Size Heater\t1\tFull-size, Pre-installed\t\t\t- Integrated 150C self-recovery fuse\t\t\t\t\t- Pre-installed RF125 fuse\t\t\t\t\t- With extra thermistor for buildplate\t\t\t\tPEI\tDouble Sided Textured PEI Spring Steel\t1\t\t\tPulley/Idler/Bearing\tGT2 Pulley 20T 5ID 6W\t2\t\t\t\tGT2 Idler 20T 5ID 6W\t2\t\t\t\tF695-2RS\t20\t\t\t\t\t\t\t#5\tBelt\tGates LL-2GT-6 RF 5m\t1\t\t\t\tGates LL-2GT-9 RF 5m\t1\t\t\tFans\tGDSTime 6020 Dual Bearings Fan\t\t\t\t\t- With XH2.54 Connector\t2\tFor Electronic Bay Cooling\t\tMisc\tNylon Ties 4x200mm\t1\t\t\t\tPC4-01 Bowden Connector\t1\t\t\t\tBowden Tube 4x2 200mm\t1\t\t\t\tBowden Tube 4x3 2m\t1\t\t\t\tSSR DIN Mount\t1\t\t\t\t3M 5952 Tape 6mm3m1mm\t1\t\t\t\tEVA Tape 5mmx1mmx5m\t1\t\t\t\tEVA Tape 5mmx3mmx4m\t2\t\t\t\t6x3 Neodimium Magnet\t10\t\t\t\tPower Inlet With 10A Fuse\t1\t\t\tWiring\tUK2.5 Terminals Set\t1\t\t\t\tY Endstop PCB with chamer thermistor\t1\tOmron D2F-L\t\t\tPre-crimped Cables Set\t1\t\t\t\tM12 Cable Gland\t1\t\t\t\tCable Chain 10x15\t1\t\t\t\tPVC Trunking Set\t1\t\t\t\tCable Sleeve\t1\tFor Umbilical\t\t\tStraight stainless steel elastic filament\t1\tFor Umbilical\t\t\tZ Stepper Label\t1\t\t\tElectronic\tMeanwell LRS-200-24\t1\t\t\t\tOmron G3NB-210B-1 SSR\t1\t\t\t\tBIGTREETECH M8P+CB1\t1\t\t\t\tM8P Canbridge Cable\t1\t\t\t\tBIGTREETECH TMC2209\t6\t\t\t\tBIGTREETECH Mini12864\t1\t\t\tNevermore\tGDSTime 5015 Fan\t2\t24V, dual bearings\t\t\tXH2.54 Connectors Set\t1\t\t\t\t6x3mm Magnet\t8\t\t\tStealthburner\tEBB SB2209\t1\t\t\t\tX Endstop\t1\tOmron D2F-L\t\t\tMOONS' NEMA14 Stepper\t1\t\t\t\tBMG Set\t1\t\t\t\tGDSTime 4010 Fan\t1\t24V, dual bearings\t\t\tGDSTime 5015 Fan\t1\t24V, dual bearings\t\t\tSK6812 LED For Stealthburner\t1\t\t\t\tVORON Tap Kit\t1\t5V, with medium-preload MGN9H-50\t\t\t24V 50W Hotend Heater\t1\t\t\t\tNTC100K B3950\t1\t\t\t\tExtra screws Stealthburner / EBB SB\t1\t\t\tLED\tDisco Stick XXL\t2\tOptional\t\tHotend\tPhaetus Dragon HF\t1\t\t\t\t\t\t\t#6\tPanels\tPC Clear Panels Set [3mm]\t1\tDoor/Side/Top\t\t\tABS Back Panel [3mm]\t1\t\t\t\tABS Button Panel [3mm]\t1"}},"/VORON-2.4-CBT-KIT/Print-Guide":{"title":"Print Guide","data":{"stl-files#STL Files":"All MPX-specific printed parts are available as STL's on our Github.  There's also a printed parts list for the entire kit in Google Docs that may be helpful to you.","electronics-bay#Electronics Bay":"Completely skip offical electronics_bay folder.Print our printed parts with name starting with Elec in our Github. Specifically, you will need these parts:\n2 pcs Elec_Din_Clip_x2.stl\n4 pcs Elec_LRS_200_Mount_x4.STL\n1 pcs Elec_M8P_Mount.STL","exhaust-filter#Exhaust Filter":"We use Nevermore in our kit, so you can completely skip the Voron offical exhaust filter folder. Print these parts instead to seal the back panel.\n1 pcs Exhaust_cover.stl\n1 pcs Exhaust_grill.stl","gantry#Gantry":"Skip these parts.  They aren't required given that our kit uses CAN and Tap.\nSTLs/Gantry/AB_Drive_Units/[a]_cable_cover.stl\nSTLs/Gantry/X_Axis/XY_Joints/[a]_endstop_pod_D2F_switch.stl\nSTLs/Gantry/X_Axis/XY_Joints/[a]_endstop_pod_hall_effect.stl\nSTLs/Gantry/X_Axis/XY_Joints/[a]_endstop_pod_hall_effect.stl\nSTLs/Gantry/X_Axis/XY_Joints/[a]_xy_joint_cable_bridge_2hole.stl\nSTLs/Gantry/X_Axis/XY_Joints/[a]_xy_joint_cable_bridge_3hole.stl\nSTLs/Gantry/X_Axis/X_Carriage/*\nSTLs/Gantry/X_Axis/Z_Joints/z_joint_upper_hall_effect.stl","panel_mounting#Panel_Mounting":"Use deck_support_3mm_x8.stl and skip the 4mm one.","if-you-are-using-disco-sticks#If you are using Disco Sticks:":"Skip Z_belt_Cover and use our Panel_Z_Belt Cover:\nPanel_Z_belt_cover_A.stl\nPanel_Z_belt_cover_B.stl\nPanel_Z_belt_cover_Route_A.stl\nPanel_Z_belt_cover_Route_B.stl\nThe route Z Belt Cover comes from tanaes's whopping_Voron_mods","skirts#Skirts":"Use power_inlet_IECGS_1.2mm.stl and skip other power_inlet_*","z-endstop#Z Endstop":"Skip this folder, we use Voron Tap as z endstop.","voron-tap#Voron Tap":"Print these parts and follow official tap guide.https://github.com/VoronDesign/Voron-Tap/tree/main/STLsPrint Tap_Upper_PCB_r8.stl and skip other Tap_Upper_*","stealthburner#Stealthburner":"Skip X_Carriage folderSkip Clockwork2/cable_door.stl and print cable_door_for_pcb.stlSkip Clockwork2/chain_*Print these from our Github:\nToolhead_Cable_Bridge.STL\nToolhead_Can_Cable_Fix.stl","optional#Optional":"BIGTREETECH has a modified CW2 main_body and cable_door printed parts. They can improve the fit of the SB2209 within the Stealthburner.\nBIGTREETECH SB2209 Github STLs\nCable Cover for PCB V1.2\nMain Body v1.2","disco-stick#Disco Stick":"Print 2pcs LED_2020_x2.stlThis mod comes from Daylight"}},"/VORON-2.4-CBT-KIT/Umbilical-Guide":{"title":"Umbilical Guide","data":{"summary#Summary":"This is divided into two parts: the Y endstop on the A driver and the EBB SB on the toolhead.Our kit comes with a 1mm stainless steel wire that can prevent the umbilical cord from sagging.There is also an additional cable sleeve that you can use if you like.For umbilical we use the cable provided by EBB SB, you need to cut it to a proper length when you complete it.","steel-wire-length#Steel wire length":"We recommend to mount it at the Y endstop first, then leave a proper length to the toolhead and cut it.The max length is when the toolhead is at front left.","step-by-step#Step by Step":"Before you start, you need to cut the JST connector off of EBB SB2209 cable, as it's too big to go through M12 Cable Gland, with the Canbridge cable in our kit, you don't need to re-crimp it.\nPlugin the cable connector to toolhead side, and install the steel wire to CW2 Cable Bridge (if you don't know what it is, scroll down, there's a pic)\nSlide the wire sleeve onto the EBB SB Cable, use a Zip Tie or heat shrink tube to fix it. (optional), just to clean up the appearance.\nGo through the M12 cable gland, install the steel wire on the Y endstop station, leave a proper length then cut any extra steel wire.\nGo through Z chain and come in the electronics bay, there would be 4 wires:Red : White UK2.5 terminal (24V+)Black : Black UK2.5 terminal (24V+)Yellow : Can_H on Canbridge cableGreen : Can_L on Canbridge cableFollow this: https://mpx.wiki/cbt-wiring-guide#toolboard-24v-wire","a-driver#A Driver":"Use M3x6 BHCS to mount the Y endstop PCB.Then use M3x8 SHCS to install it on the A drive.","toolhead#Toolhead":"You can use Zip Ties instead of the printed cable clips.For more detail, you can check the BIGTREETECH EBB SB user guide"}},"/VORON-2.4-CBT-KIT/Wiring-Guide":{"title":"V2.4 CBT Wiring Guide","data":{"":"This page covers the wiring specific to the V2.4 printer. Please also review the General Wiring Guide for information common to both the V2.4 and the Trident (Stealthburner, Disco LEDs, etc).","before-you-start#Before You Start":"Make sure the 110V/230V switch on your LRS-200-24 power supply is in the right orientation.\nWe strongly recommend you flash the M8P/SB2209 before you install them. This usually saves you 2 hours or more of work.  Check this page if you have a Manta M8P V2, or this page if you have a Manta M8P V1. Note that the kits have been shipping with V2 since late fall of 20223.\nZ Chain:300mm = 25 links, 350mm = 28 links.You may have to remove a few links according to your build size.","layout#Layout":"Use 3M 5952 Tape to mount the PVC trunkings. We recommend you clean the area to be bonded with IPA (Isopropyl Alcohol) to ensure good adhesion.Our PSU mounting is different from the official Voron one. Please refer to the Print Guide for instructions.\nNote the orientation of the Solid State Relay (SSR). It has an AC side and a DC side. You must be extremely careful that you don't wire the SSR the wrong way around or you will damage it and, potentially, other parts of the printer as well.","ac-wiring#AC Wiring":"","dc-wiring#DC Wiring":"","complete#Complete":"","manta-m8p-wiring#Manta M8P Wiring":"","jumpers-setting#Jumpers Setting":"","color-wiring#Color Wiring":"","m8p-v2-with-mini12864-v2#M8P V2 with Mini12864 V2":"","bed-heater-wiring#Bed Heater Wiring":"","toolboard-24v-wire#Toolboard 24V wire":"The default wires are tinned. Solder cold flows/creeps under load and can become a fire-hazard. You can crimp the connection with a pin terminal or cut them off and use bare wire in the terminal blocks instead.","m8p-canbridge-wire#M8P Canbridge Wire":"","wiring-complete#Wiring Complete":""}},"/VORON-AWD-2WD-MOD/bom":{"title":"VORON 2.4 9mm 2WD/AWD BOM","data":{"generic-fasteners#Generic Fasteners":"Name\tRear Motor Mount\tXY Joint\tFront Motor Mount\tZ Chain Mount\tTotal\tNote\t3x5x4 Insert\t\t\t\t3\t1\tCan be 2 If D2F endstop\tM2x10 Self Tapping\t\t\t\t2\t2\tIf D2F endstop\tM3x6 BHCS\t\t\t\t2\t2\tIf MPX Y endstop PCB\tM3x6 SHCS\t\t8\t\t\t8\t\tM3x12 SHCS\t\t\t\t2\t2\t\tM3x14 SHCS\t2\t\t\t\t2\t\tM3x38 SHCS\t6\t8\t4\t\t18\t\tM3x40 SHCS\t8\t\t8\t\t16\t\tM5x10 BHCS\t\t\t\t1\t\tIf D2F endstop\tM5x12 BHCS\t\t4\t\t\t\t\tM5x14 BHCS\t8\t2\t\t\t10\t\tM5x20 BHCS\t4\t\t4\t\t8\t\tM5x35 BHCS\t2\t\t2\t\t4","awd#AWD":"Name\tQty\tNote\t3x5 Aluminium Pin\t16\t\t3x7 Aluminium Pin\t6\t\tNEMA17 w/ 38mm shaft\t4\tKit comes with MOONS' MS17HD6P4200 w/ 38mm shaft\tF695-2RS\t32\t\t695-2RS\t14\t\tPulley 5mm ID 9mm wide\t4\t\tIdler 5mm ID 9mm wide\t4\tMust be Gates, height 14mm\t9mm 2GT Belt\t5\t5m total, recommend Gates-2GT-9 RF/EPDM","2wd#2WD":"Name\tQty\tNote\t3x5 Aluminium Pin\t10\t\t3x7 Aluminium Pin\t4\t\tNEMA17 w/ 38mm shaft\t2\tKit comes with MOONS' MS17HD6P4200 w/ 38mm shaft\tF695-2RS\t22\t\t695-2RS\t10\t\tPulley 5mm ID 9mm wide\t2\t\tIdler 5mm ID 9mm wide\t2\tMust be Gates, height 14mm\t9mm 2GT Belt\t5\t5m total, recommend Gates-2GT-9 RF/EPDM"}},"/VORON-AWD-2WD-MOD/2.4-wiring":{"title":"Voron 2.4 AWD/2WD Wiring","data":{"":"You can find printed parts on our github.https://github.com/MagicPhoenix/MPX-VORON-AWD","z-chain-mount--y-endstop#Z Chain Mount / Y Endstop":"Note: They are both designed for umbilical, both need M12 cable gland.\nYou will have to move the buttom Z chain mount to left for more space on A driver tensioner.","d2f-microswitch#D2F MicroSwitch":"","mpx-y-endstop-pcb#MPX Y Endstop PCB":"","cable-gland#Cable Gland":"The standard cable gland will come with a m12 nut, we will use it instead of printed threads.If you have a steel wire, just go through the gland and tighten the nut, it should be able to hold it there.","front-steppers#Front Steppers":"Currently there are two ways to wire it, one on the side of Y extrusions, the other way on top of Y extrusions.","on-the-side-of-y-extrusions#On the side of Y extrusions":"Print wiring_side_x2.stlIf using this way,you need to make side panels foam thicker, 6mm would be fine.(standard voron is 3mm)","on-top-of-y-extrusions#On top of Y extrusions":"Print wiring_top_front.stl and wiring_top_back.stl"}},"/VORON-AWD-2WD-MOD/2.4-manual":{"title":"VORON V2.4 9mm 2WD/AWD Manual","data":{"pulley-install#Pulley Install":"Use the printed tool pulley_jig to install pulleys, each needs 2. (For 2WD each only needs 1)","screws-install#Screws Install":"","toolhead#Toolhead":""}},"/VORON-AWD-2WD-MOD/intro":{"title":"Intro","data":{"origin#Origin":"It's a modified version of aTinyShellScript's v2.4_AWD mod, we make it more suitable for CNC machining, add extra support bearings for steppers and XY Joint.Thanks to aTinyShellScript's mod, we can't bring it to reality without his mod.","discord#Discord":"We have a channel for this, you can this linkhttps://discord.gg/r5YvA7tpaZ","whats-awd2wd#What's AWD/2WD?":"They are abbreviations for All Wheel Drive and 2-Wheel Drive.2WD is two steppers drive just like a standard corexy motion system.AWD converts the front idlers to two extra steppers drives.You can see the difference by this pic.","is-the-2wd-same-as-stock-voron-gantry#Is the 2WD same as stock VORON gantry?":"Nope, the AB drivers is different, now tensioners are on the AB drivers, and belt route on AB drivers also changed.","why-9mm-ab-belt#Why 9mm AB belt？":"Enhanced rigidity of the entire XY motion system.\n300% Recommened accel of IS result.\nLonger life than 6mm.","why-extra-support-bearing-on-stepper-shafts#Why Extra support bearing on stepper shafts?":"The tension of the 9mm belt is much greater than 6mm, as the datasheet stock stepper shaft can't handle it, it may bent the shaft   or damage the stepper bearing under correct belt tension. So we specified 38mm shaft stepper for the support bearing.","will-it-be-super-expensive-#Will it be super expensive ?":"No.We are not doing gucci things,  instead we want to bring it to everyone.The 2WD cost is very similar to 6mm, CNC parts are machined in our workshop so we can sell it on a accepable price.","will-i-lose-some-build-volume#Will I lose some build volume?":"Yes, you will lose around 50mm on Y axis.If you use custom bed shape, then you would only loose two corners. Around 50x50mm per coner.","what-toolhead-carrier-i-should-use#What toolhead carrier I should use?":"There are some printed 9mm carrier in community, but make sure to print with more infill (recommened 50%+) as the high tension of belts.","cnc-quick-change-carrier#CNC Quick Change Carrier":"It has two parts, belt clamp and toolhead mount, so you can remove the whole toolhead by 3 screws.Can work with most probes like klicky, beacon, Bltouch. (But yes, you need to design the mount yourself)The belt clamp also has four threaded holes same as MGN9H by Z offset, so you can install other carrier directly.","cnc-normal-change-carrier#CNC Normal Change Carrier":"In order to install the 9mm belt, the carrier will be divided into two parts,and the large base part needs to be installed first.\nCompared to the previous one, the center of gravity of the print head has basically not been generated.\nAlso can work with most probes like klicky, beacon, Bltouch.","can-i-get-the-cad-files#Can I get the CAD files?":"Yes we will release it once we have finished organizing it.Before that you can ask for the specific size.As a typical value, the distance between AB belts is 5mm.","is-there-a-trident-version#Is there a Trident version?":"Yes, expected the end of Nov.In trident version the front steppers are flipped."}},"/VORON-AWD-2WD-MOD/trident-manual":{"title":"Trident AWD/2WD Manual","data":{"extrusion-cut#Extrusion Cut":"As 9mm belts are extended a bit, the rear extrusion needs to be filed like this:We made a printed jig for this, you can download it on github:https://github.com/MagicPhoenix/MPX-VORON-AWD/blob/main/Printed%20Parts/Trident/Extrusion_cut_jig.stlAnother way is just cut 2.5mm short.The 2.5x4mm area is what needs to be cut off.You also need different printed brackets, download here:https://github.com/MagicPhoenix/MPX-VORON-AWD/tree/main/Printed%20Parts/Trident","install#Install":"","ab-driver#A/B Driver":"","xy-joint#XY Joint":"","front-driver#Front Driver":""}},"/VORON-AWD-2WD-MOD/tuning":{"title":"Tuning","data":{"target#Target":"FYI input shaper result:You should be able to get around 110 Hz on X axis and 75 Hz on Y axis.","mechanical#Mechanical":"","screws#Screws":"Make sure all screws are tighteded.","pulley-grub-screws-awd-only#Pulley grub screws (AWD Only)":"We recommend to tighten the rear pulleys' grub screws, they should align to the flat of stepper shaft.Then move the toolhead by hand a few times at full travel. After that you can tighten the front pulleys.Notice the front pulleys' grub screws shound't align to the flat shaft.","belt#Belt":"","belt-tension#Belt Tension":"You should get 160-180Hz/150mm, A/B belts must have same tension.When adjusting, you have to loosen the 4 screws per rear stepper.After adjustment is done, remember to tighten them."}},"/VORON-TRIDENT-CBT-KIT/About-Trident-Kit":{"title":"About","data":{"1-whats-the-difference-between-trident-cbt-lite-trident-cbt-standard--and-offical-trident-#1. What's the difference between Trident CBT Lite, Trident CBT Standard  and offical Trident ?":"Difference\tTrident Lite\tTrident Standard\tOffical Trident\tCanbus Toolboard\tEBB SB2209\tEBB SB2209\tNone\tUmbilical\tYes\tYes\tNo\tProbe\tVoron Tap\tVoron Tap\tPL-08N\tZ travel\t250mm\t300mm\t250mm\tZ Stepper\tNormal Brand\tMOONS' Stepper\t-\tFrame Color\tBlack\tBlack / Space Gray option\tBlack\t\nYou can check out our Trident kit BOM here on the Wiki."}},"/VORON-TRIDENT-CBT-KIT/Assembly-Tips":{"title":"Assembly Tips","data":{"trident-assembly-tips#Trident Assembly Tips":"The kit's packaging is designed by the assembly sequence.  We strongly recommend not taking parts and pieces out of each layer. You can take every layer out but keep them as layers with parts intact.\nThese Assembly Tips are specific to the Trident. You will also need to refer to the General Assembly Tips that are common to the V2.4 and the Trident. The V2.4-specific assembly tips are here.","frame#Frame":"","packing-layer-1#Packing Layer #1":"Notice the color on the foam and the frame.","packing-layer-2#Packing Layer #2":"There's only one extrusion in this layer, it's the yellow one.","packing-layer-3#Packing Layer #3":"","y-endstop#Y Endstop":"1.Install two M3 inserts into these 2 holes.2.Use M3x8 SHCS to mount the Y endstop PCB3.Install on gantryThey should install on the A drive. You need M5x16 BHCS and M3x25 SHCS here","frame-wiring#Frame Wiring":"Instead of the printed wire clip, we add more extrusion covers in the kit.You can use them to hide the wires.\nOnce again, remember to refer to the General Assembly Tips for those parts of the build common between the V2.4 and the Trident (Stealthburner, Tap, etc)"}},"/VORON-TRIDENT-CBT-KIT/Print-Guide":{"title":"Print Guide","data":{"stl-files#STL Files":"All MPX-specific printed parts are available as STL's on our Github. There's also a printed parts list for the entire kit in Google Docs that may be helpful to you.\nThe items listed below are not a comprehensive list of the deltas from the official Voron Trident. Refer to the V2.4 Print Guide for parts common to the Trident and the V2.4 (Stealthburner, Tap, etc). The Google Doc linked above should be considered the definitive reference.","display#Display":"This mod comes from Ken226's BTT TFT35 SPI V2.1 Touch Screen Case. That link also has the full assembly instructions for the screen case so be sure to review it.","disco-stick#Disco Stick":"Print 2pcs LED_2020_x2.stlThis mod comes from Daylight"}},"/VORON-TRIDENT-CBT-KIT/Trident-CBT-Bom":{"title":"Trident Cbt Bom","data":{"bom-list#BOM List":"The MPX Trident is available in Lite and Standard versions.","trident-cbt-lite#Trident CBT Lite":"Layer\tPart\tProduct\tQty\tLayer #1\tFrame\tTrident 350x350x250 Frame\t1\t\tFasteners\tTrident Fasteners Kit\t1\t\t\t\t\tLayer #2\tSteppers\tNEMA17 Leadscrew Stepper\t3\t\t\tMOONS' MS17HD6P4200\t2\t\tRails\tMGN9H-300 - Z rails\t3\t\t\tMGN9H-350/400 - Y rails\t2\t\tFrame\tFrame - D Extrusion\t1\t\tMotion\tGT2 Pulley 20T 5ID 6W\t2\t\tMotion\tF695-2RS Bearing\t16\t\tMisc.\tRubber Feet\t4\t\t\t\t\tLayer #3\tRails\tMGN12H-350/400 X rail\t1\t\tFrame\tFrame - E extrusion\t1\t\tMotion\tGT2 Idler 20T 5ID 6W\t2\t\t\tF695-2RS Bearing\t4\t\t\tGE5C Bearing\t3\t\tFrame\tFrame - G extrusion\t1\t\t\tFrame - F extrusion\t1\t\tPlate\tMPX Cast aluminium build plate\t1\t\t\tMPX Full-size Heater\t1\t\t\t- Integrated 150C self-recovery fuse\t\t\t\t- Pre-installed RF125 fuse\t\t\t\t- With extra thermistor for build plate\t\t\t\t\t\tLayer #4\tPlate\tDouble Sided Textured PEI Spring Steel\t1\t\tPanels\tABS Deck Panel [3mm]\t1\t\tFrame\tDIN Rail\t2\t\t\t\t\tLayer #5\tBelt\tGates LL-2GT-6 RF 5m\t1\t\tFans\tGDSTime 6020 Dual Bearings Fan\t\t\t\t- With XH2.54 Connector\t2\t\tMisc.\tNylon Ties 4x200mm\t1\t\t\tPC4-01 Bowden Connector\t1\t\t\tBowden Tube 4x2 200mm\t1\t\t\tBowden Tube 4x3 2m\t1\t\t\tSSR DIN Mount\t1\t\t\t3M 5952 Tape 6mm3m1mm\t1\t\t\tEVA Tape 5mmx1mmx5m\t1\t\t\tEVA Tape 5mmx3mmx5m\t2\t\t\t6x3 Neodymium Magnet\t10\t\t\tPower Inlet With 10A Fuse\t1\t\tWiring\tUK2.5 Terminals Set\t1\t\t\tY Endstop PCB with chamber thermistor\t1\t\t\tPre-crimped Cables Set\t1\t\t\tM12 Cable Gland\t1\t\t\tCable Chain 10x11\t1\t\t\tPVC Trunking Set\t1\t\t\tCable Sleeve\t1\t\t\tStraight stainless steel elastic filament\t1\t\t\tZ Stepper Label\t1\t\tElectronic\tMeanwell LRS-200-24\t1\t\t\tOmron G3NB-210B-1 SSR\t1\t\t\tBIGTREETECH M8P+CB1\t1\t\t\tM8P Canbridge Cable\t1\t\t\tBIGTREETECH TMC2209\t6\t\t\tBIGTREETECH TFT35 SPI Touchable Screen\t1\t\tNevermore\tGDSTime 5015 Fan\t2\t\t\tXH2.54 Connectors Set\t1\t\t\t6x3mm Magnet\t8\t\tStealthburner\tEBB SB2209\t1\t\t\tMOONS' NEMA14 Stepper\t1\t\t\tBMG Set\t1\t\t\tGDSTime 4010 Fan\t1\t\t\tGDSTime 5015 Fan\t1\t\t\tSK6812 LED For Stealthburner\t1\t\t\tVORON Tap Kit\t1\t\t\t24V 50W Hotend Heater\t1\t\t\tNTC100K B3950\t1\t\t\tExtra screws Stealthburner / EBB SB\t1\t\tHotend\tPhaetus Dragon UHF\t1\t\t\t\t\tLayer #6\tPanels\tClear PC Panels [3mm]\t1\t\t\tABS Panels [3mm]\t1","trident-cbt-standard#Trident CBT Standard":"Layer\tPart\tProduct\tQty\tLayer #1\tFrame\tTrident 350x350x300 Frame\t1\t\tFasteners\tTrident Fasteners Kit\t1\t\t\t\t\tLayer #2\tSteppers\tMOONS' LE174S-T0804-350\t3\t\t\tMOONS' MS17HD6P4200\t2\t\tRails\tMGN9H-350 - Z rails\t3\t\t\tMGN9H-350/400 - Y rails\t2\t\tFrame\tFrame - D Extrusion\t1\t\tMotion\tGT2 Pulley 20T 5ID 6W\t2\t\tMotion\tF695-2RS Bearing\t16\t\tMisc.\tRubber Feet\t4\t\t\t\t\tLayer #3\tRails\tMGN12H-350/400 X rail\t1\t\tFrame\tFrame - E extrusion\t1\t\tMotion\tGT2 Idler 20T 5ID 6W\t2\t\t\tF695-2RS Bearing\t4\t\t\tGE5C Bearing\t3\t\tFrame\tFrame - G extrusion\t1\t\t\tFrame - F extrusion\t1\t\tPlate\tMPX Cast aluminium build plate\t1\t\t\tMPX Full-size Heater\t1\t\t\t- Integrated 150C self-recovery fuse\t\t\t\t- Pre-installed RF125 fuse\t\t\t\t- With extra thermistor for build plate\t\t\t\t\t\tLayer #4\tPlate\tDouble Sided Textured PEI Spring Steel\t1\t\tPanels\tABS Deck Panel [3mm]\t1\t\tFrame\tDIN Rail\t2\t\t\t\t\tLayer #5\tBelt\tGates LL-2GT-6 RF 5m\t1\t\tFans\tGDSTime 6020 Dual Bearings Fan\t\t\t\t- With XH2.54 Connector\t2\t\tMisc.\tNylon Ties 4x200mm\t1\t\t\tPC4-01 Bowden Connector\t1\t\t\tBowden Tube 4x2 200mm\t1\t\t\tBowden Tube 4x3 2m\t1\t\t\tSSR DIN Mount\t1\t\t\t3M 5952 Tape 6mm3m1mm\t1\t\t\tEVA Tape 5mmx1mmx5m\t1\t\t\tEVA Tape 5mmx3mmx5m\t2\t\t\t6x3 Neodymium Magnet\t10\t\t\tPower Inlet With 10A Fuse\t1\t\tWiring\tUK2.5 Terminals Set\t1\t\t\tY Endstop PCB with chamber thermistor\t1\t\t\tPre-crimped Cables Set\t1\t\t\tM12 Cable Gland\t1\t\t\tCable Chain 10x11\t1\t\t\tPVC Trunking Set\t1\t\t\tCable Sleeve\t1\t\tElectronic\tMeanwell LRS-200-24\t1\t\t\tOmron G3NB-210B-1 SSR\t1\t\t\tBIGTREETECH M8P+CB1\t1\t\t\tM8P Canbridge Cable\t1\t\t\tBIGTREETECH TMC2209\t6\t\t\tBIGTREETECH TFT35 SPI Touchable Screen\t1\t\tNevermore\tGDSTime 5015 Fan\t2\t\t\tXH2.54 Connectors Set\t1\t\t\t6x3mm Magnet\t8\t\tStealthburner\tEBB SB2209\t1\t\t\tMOONS' NEMA14 Stepper\t1\t\t\tBMG Set\t1\t\t\tGDSTime 4010 Fan\t1\t\t\tGDSTime 5015 Fan\t1\t\t\tSK6812 LED For Stealthburner\t1\t\t\tVORON Tap Kit\t1\t\t\t24V 50W Hotend Heater\t1\t\t\tNTC100K B3950\t1\t\t\tExtra screws Stealthburner / EBB SB\t1\t\tHotend\tPhaetus Dragon UHF\t1\t\t\t\t\tLayer #6\tPanels\tClear PC Panels [3mm]\t1\t\t\tABS Panels [3mm]\t1"}},"/VORON-TRIDENT-CBT-KIT/Wiring":{"title":"Wiring Guide","data":{"":"This page covers the wiring specific to the Trident printer. Please also review the General Wiring Guide for information common to both the V2.4 and the Trident (Stealthburner, Disco LEDs, etc).","before-you-start#Before You Start":"Make sure the 110V/230V switch on your LRS-200-24 power supply is in the right orientation.\nWe strongly recommend you flash the M8P/SB2209 before you install them. This usually saves you 2 hours or more of work.  Check this page if you have a Manta M8P V2, or this page if you have a Manta M8P V1. Note that the kits have been shipping with V2 since late fall of 20223.","bigtreetech-spi35-touch-screen#BIGTREETECH SPI35 Touch Screen":"We strongly recommend you install the Flat Flexible cable for the display on the Manta M8P side before you install the Manta on the DIN rails. The shiny contacts on the cable should face the board. The connector is on the back of the M8P.Uncomment this line from BoardEnv.txt. This file is in CB1 TF card /boot.","layout#Layout":"Use 3M 5952 Tape to mount the PVC trunkings. We recommend you clean the area to be bonded with IPA (Isopropyl Alcohol) to ensure good adhesion.Our PSU mounting is different from the official Voron one. Please refer to the Print Guide for instructions.\nNote the orientation of the Solid State Relay (SSR). It has an AC side and a DC side. You must be extremely careful that you don't wire the SSR the wrong way around or you will damage it and, potentially, other parts of the printer as well.","ac-wiring#AC Wiring":"","dc-wiring#DC Wiring":"","complete#Complete":"","manta-m8p-wiring#Manta M8P Wiring":"","jumpers-setting#Jumpers Setting":"","color-wiring#Color Wiring":"","bed-wiring#Bed Wiring":"","toolboard#Toolboard":"Note: you need to remove the outer sheath of SB2209 cable for some length on electronic bay side.","toolboard-24v#Toolboard 24V":"The default wires are tinned. Solder cold flows/creeps under load and can become a fire-hazard. You can crimp the connection with a pin terminal or cut them off and use bare wire in the terminal blocks instead.","m8p-canbridge-wire#M8P Canbridge Wire":"","wiring-complete#Wiring Complete":""}},"/":{"title":"MPX WIKI","data":{"":"Welcome to the MPX Wiki. It's goal is to document our two main printer kits\nThe Voron 2.4 CBT Kit\nThe Voron Trident CBT Kit available in two versions: Lite and Standard\nNeed more help? Just jump on Discord and ask! There is the MPX Channel on the Voron Discord. Most people learn about the Magic Phoenix kit from here. There is also the dedicated MPX Discord. This tends to be the more active of the two specific to MPX printer kits.","want-to-help#Want to Help?":"Your are welcome to help improve this wiki!  You can fork the github repo and submit a PR.  All pages are in markdown format that is easy to learn. Images should be uploaded to this site (no login needed). Uploading an image will return a URL that you can then reference within the text.We appreciate your help in making the wiki better!","feedback#Feedback":"If you have any feedback, you can click on the feedback link on the right side of each page and leave it on Github."}}}